[{"verse":"Genesis 2:24-25 ESV","verseRepeat":"Therefore a man shall leave his father and hismother and hold fast to his wife, and they shallbecome one flesh. And the man and his wife wereboth naked and were not ashamed.","blurb":"0: Marriage in many ways is a glimpse into the life at the garden of Eden. When in marriage you can be naked with someone and feel no shame and be united as one flesh, not only is sex but in the sharing of burdens pains and joys. AP: God thank you for this great blessing of marriage you have placed in my life. Thank you for Libby, and all of the amazing things you've gifted me through her. I ask you'd empower me to be a good husband and to care for her as you would have me. Help me be a good man to her and to any children you may bless us with. Thank you for this day you have made.","name":"IMG_0268.txt","index":1},{"verse":"Genesis 3:17 ESV","verseRepeat":"And to Adam he said, \"Because you have listenedto the voice of your wife and have eaten of the treeof which I commanded you, You shall not eat of it,'cursed is the ground because of you; in pain youshall eat of it all the days of your life;","blurb":"OA: the failure of man started with a failure of leadership. Adam did not heed for himself the warnings of God but instead went along with what others were telling him. In all things we should focus on Gods words to us and what he is trying to tell us and not the world or anyone else. P: God I ask you'd help me do this. Help me here your voice clearly and to do what is wise and right in your eyes and not the eyes of men or the enemy. I ask you'd defend me from temptation and that I'd steer others away from it as well. Thank you for this day you have made and help me use tomorrow well.","name":"IMG_0270.txt","index":2},{"verse":"Genesis 8:21 ESV","verseRepeat":"And when the Lord smelled the pleasing aroma,the Lord said in his heart, \"I will never again cursethe ground because of man, for the intention ofman's heart is evil from his youth. Neither will Iever again strike down every living creature as Ihave done.","blurb":"OA: the heart of man desires to go astray from its very beginning. It is only by the grace of God and diligently seeking what is right that we rise above this. P: God if you ever bless me and Libby with children I ask you'd make me wise so that I can raise them well in spite of this tendency, to still have them glorify you above all and reject the desires of the flesh. Thank you for your word and this day God.","name":"IMG_0271.txt","index":3},{"verse":"Genesis 9:23 ESV","verseRepeat":"Then Shem and Japheth took a garment, laid it onboth their shoulders, and walked backward andcovered the nakedness of their father. Their faceswere turned backward, and they did not see theirfather's nakedness.","blurb":"OA: All humans are worthy of dignity no matter their state or station. Though Noah was asleep after heavy drinking, all interactions with him were still to be done in love and respect. When one of Noah's sons failed to do this he was cursed. P: God I ask you'd guide my interactions with others, that I'd treat them with the dignity they deserve as your image bearer. Help me bear your image better and be more like your son. Thank you for this day you have made and your countless blessings","name":"IMG_0273.txt","index":4},{"verse":"Genesis 11:4 ESV","verseRepeat":"Then they said, \"Come, let us build ourselves a cityand a tower with its top in the heavens, and let usmake a name for ourselves, lest we be dispersedover the face of the whole earth.\"","blurb":"OA: Our obedience to God may often be in the way of worldly progress and rising among our fellow man. But this is good and right. We should discipline ourselves and put God above any treasure or goal. Christ is our king and life with him is the prize. P: God I ask you help me do this better. I ask you'd forgive me my idols and make in me a new heart focused on you. Thank you for your word and for this day.","name":"IMG_0276.txt","index":5},{"verse":"Exodus 31:6 ESV","verseRepeat":"And behold, I have appointed with him Oholiab, theson of Ahisamach, of the tribe of Dan. And I havegiven to all able men ability, that they may make allthat I have commanded you:","blurb":"OAP: God I ask in a similar way, though perhaps a more humble way, that my wife and I would offer up these talents you have given us back to you for your kingdom's betterment and for your glory. You are a God and king and I dedicate what little I can make as a man to you Lord. May it please you and may you steer my hands and mind in such a way that it pleases you. Thank you for this day and glory to you God. Thank you for your saving grace through your son. And in his name I pray, amen.","name":"IMG_0262.txt","index":6},{"verse":"Deuteronomy 1:31-32 ESV","verseRepeat":"and in the wilderness, where you have seen howthe Lord your God carried you, as a man carries hisson, all the way that you went until you came tothis place' Yet in spite of this word you did notbelieve the Lord your God,","blurb":"0: Though God proves himself to us over and over we often have failures of faith and are quick to forget times when he has proven himself to us. A: recall often Gods good things which he has done to you, his word and the times he has show himself faithful that you not forget when times are hard. P: Lord and are my provision and strength and my salvation. All I have is because of you, and without you I have nothing. I ask your forgiveness for when I have lost sight of who you are and what you have done for me and I ask you'd give me recollection of your great deeds and word when times are hard. Thank you for this day you have made.","name":"IMG_0641.txt","index":7},{"verse":"Deuteronomy 6:5 ESV","verseRepeat":"You shall love the Lord your God with all your heartand with all your soul and with all your might.","blurb":"OAP: Lord help me love you more with everything I have and am. You are my savior and my sustenance. I ask you'd forgive my sins and help me love you as you deserve. I ask you'd make in me a new heart that seeks after you and is passionate about you. You are glorious and good and you have protected me and my family. I will trust in you to help put me in the right path. Thank you Lord for this day you have made and glory to you.","name":"IMG_0278.txt","index":8},{"verse":"Deuteronomy 6:12 ESV","verseRepeat":"then take care lest you forget the Lord, whobrought you out of the land of Egypt, out of thehouse of slavery.","blurb":"OA: It is common for man on getting on his own two feet to forget that it was by the grace of God that he was placed there. God is the author of every one of our successes. It is by his grace that we live and breath and have the gifts we do. P: Lord I ask you'd always turn my heart to you and your glory. You are good God and worthy to be praised. Thank you for this day you have made and for your mercies and forgiveness you show daily. Help me be more like you.","name":"IMG_0280.txt","index":9},{"verse":"Deuteronomy 7:25 ESV","verseRepeat":"The carved images of their gods you shall burnwith fire. You shall not covet the silver or the goldthat is on them or take it for yourselves, lest you beensnared by it, for it is an abomination to the Lordyour God.","blurb":"0: though there isn't anything inherently wrong with gold or silver there is something wrong with putting yourself through temptations of idolatry over that gold and silver. Better to burn them than have them and risk sin. A: do not take on temptation purposefully - but avoid it like a plague. No reward is worth the cost of it. P: God help this wisdom be firmly in my mind that I not stray from the path you have set. Help me avoid temptations and deliver me from evil. Thank you for this day you have made and for loving me so. You provide great blessings lord. I pray those blessings would never be a stumbling block.","name":"IMG_0290.txt","index":10},{"verse":"Deuteronomy 8:3 ESV","verseRepeat":"And he humbled you and let you hunger and fedyou with manna, which you did not know, nor didyour fathers know, that he might make you knowthat man does not live by bread alone, but manlives by every word that comes from the mouth ofthe Lord.","blurb":"OA: Often God will guide us and let us go with want so that we can depend on him for what we need. God is ultimately our provider. Being in a state of want does not make that any more so the case just more obvious. In all things we should thank God as our true provider. It is not by our own efforts or because of something within us. But Gods grace. P: God I thank you for your saving grace that covers me in a way I cannot understand. I thank you for your provision. You feed my family Lord and for that we thank you. Help me always remember this and keep it close at heart.","name":"IMG_0292.txt","index":11},{"verse":"Deuteronomy 10:22 ESV","verseRepeat":"Your fathers went down to Egypt seventy persons,and now the Lord your God has made you asnumerous as the stars of heaven.","blurb":"0: God gave growth to his own body of followers. Though man is often his vessel for growth it was Him who gave it life. As he made the Jews flourish so too has he made the body of Christ cover the whole earth. A: Always give God the glory in all things. He does not leave his people to their own devices but he performs miracles in our midst and empowers his followers to do the good works he has called them to. Seek God and his desires that you may be one with him and not stray. P: God, I ask for clarity of mind and forgiveness for my sins. I am weak but through you I am strong and can do anything. You are mighty and righteous. You gave me life and sustain me each day. I ask I not squander what you have gifted but that I'd love and serve others as your son did. In his name I pray.","name":"IMG_0293.txt","index":12},{"verse":"Deuteronomy 11:2 ESV","verseRepeat":"And consider today (since I am not speaking toyour children who have not known or seen it),consider the discipline of the Lord your God, hisgreatness, his mighty hand and his outstretchedarm,","blurb":"OAP: God I ask I not forget the things you have done for me and taught me over the years and through your word. Give me a memory to recall these things that I can fend off confusion and lies when confronted with them. Thank you for this day you have made Lord and for your many blessings","name":"IMG_0295.txt","index":13},{"verse":"Deuteronomy 12:30 ESV","verseRepeat":"take care that you be not ensnared to follow them,after they have been destroyed before you, andthat you do not inquire about their gods, saying,'How did these nations serve their gods?—that Ialso may do the same'","blurb":"OAP: God help me follow you and only you. Help me always know the difference between your voice and another. Help me always honor and glorify you alone and never get swept up in worldly concerns or false religions. Give me a clarity of mind and wisdom about you and your son. I thank you for this day you have made and glory to your name God.","name":"IMG_0297.txt","index":14},{"verse":"Deuteronomy 13:5 ESV","verseRepeat":"But that prophet or that dreamer of dreams shallbe put to death, because he has taught rebellionagainst the Lord your God, who brought you out ofthe land of Egypt and redeemed you out of thehouse of slavery, to make you leave the way inwhich the Lord your God commanded you to walk.So you shall purge the evil from your midst.","blurb":"OA: if there are those who would attempt to entice us to serve other gods or to worship something other than God, we are to completely cast that away from us. It's very dangerous to be around those like this because our tendency to construct idols is powerful. P: God I ask you'd forgive me for seeking things other than your kingdom. Help me serve you well and glorify you and help me identify and cast out the things enticing me to stray. Thank you for this day you have made.","name":"IMG_0298.txt","index":15},{"verse":"Deuteronomy 14:23 ESV","verseRepeat":"And before the Lord your God, in the place that hewill choose, to make his name dwell there, youshall eat the tithe of your grain, of your wine, andof your oil, and the firstborn of your herd and flock,that you may learn to fear the Lord your Godalways.","blurb":"OAP:Lord I ask you'd teach me what in means in this day and age what it is to give you first Fruits, and set them aside for you. Everything I have is by the grace of your hands and you are the care giver and provider for this family, and I thank you for all you have done for us. If I withhold what is yours I ask you'd convict me that I may turn away from that dishonorable thing, and return to you what you have asked for.","name":"IMG_0307.txt","index":16},{"verse":"Deuteronomy 15:11 ESV","verseRepeat":"For there will never cease to be poor in the land.Therefore I command you, 'You shall open wideyour hand to your brother, to the needy and to thepoor, in your land'","blurb":"OAP: Lord I ask you'd guide me to better serve the poor in my local community and globally. Help me be wise in generosity and give liberally where it is beneficial and the need is great. Help me see good opportunities for generosity and help me know when giving is wise or not. Thank you for this day you have made and the time with my wife.","name":"IMG_0308.txt","index":17},{"verse":"Deuteronomy 17:20 ESV","verseRepeat":"that his heart may not be lifted up above hisbrothers, and that he may not turn aside from thecommandment, either to the right hand or to theleft, so that he may continue long in his kingdom,he and his children, in Israel.","blurb":"OAP: Lord I ask like this prescription to the king of Israel that I too would not raise my heart above others. Help me value and love others the way I do myself - tending carefully to their pain and taking in their burdens as my own. Help me see others as you see them. For I am not the center, but you are. And we are all made in your image. Thank you for this day you have made and I ask you'd give me wisdom to do what is right and good.","name":"IMG_0312.txt","index":18},{"verse":"Deuteronomy 18:22 ESV","verseRepeat":"when a prophet speaks in the name of the Lord, ifthe word does not come to pass or come true, thatis a word that the Lord has not spoken; theprophet has spoken it presumptuously. You neednot be afraid of him.","blurb":"OA: A prophet is to be judged by the fulfillment or not of his prophecies and if the prophet glorifies God. Anything else is not to be trusted. We should discern by fruits someone yields as a key indicator. P: God help me always remember to look at the fruits of a persons life who claims to be a prophet or a doom sayer. Help me be wise in my evaluation of these individuals and to see truth and know it when I see it, and it's alternatives. I ask you'd guide my career and help me do well and honorably.","name":"IMG_0317.txt","index":19},{"verse":"Deuteronomy 19:14 ESV","verseRepeat":"\"You shall not move your neighbor's landmark,which the men of old have set, in the inheritancethat you will hold in the land that the Lord your Godis giving you to possess.","blurb":"OA: To get ahead I should never steal what belongs to another, whether that is goods, or more likely in taking credit for their labors to try and advance up the ladder. In the workplace I should always conduct myself honorably and be quick to give credit to others and never take what is not mine. I should always give others their due. P: God I ask you'd help me conduct myself honorably in a way that pleases you as I work. Help me glorify you more and be a shining light that can encourage your children and bring those outside your family in. Help me never be selfish or pride flip but to be long suffering for the benefit of others","name":"IMG_0319.txt","index":20},{"verse":"Deuteronomy 20:19 ESV","verseRepeat":"\"When you besiege a city for a long time, makingwar against it in order to take it, you shall notdestroy its trees by wielding an axe against them.You may eat from them, but you shall not cut themdown. Are the trees in the field human, that theyshould be besieged by you?","blurb":"OA: We should honor nature and not do harm to the environment for the sake of human affairs, but instead we should do our best to lift up and preserve nature, only taking what we need. P: God I ask you'd make me a good steward of all that you have put under my charge including any land I'd have and in the purchases I make that it would be beneficial to my fellow man, the earth, and most importantly the advancement of your kingdom. Guide my hand to not be wasteful. In Jesus name I pray.","name":"IMG_0322.txt","index":21},{"verse":"Deuteronomy 32:8 ESV","verseRepeat":"When the Most High gave to the nations theirinheritance, when he divided mankind, he fixed theborders of the peoples according to the number ofthe sons of God.","blurb":"OAP: God I ask as I explore some of what these verses mean that you'd guide me to truth and understanding. Help me find what is right and to add it to my understanding of your word. Please give me wisdom and discernment in regards to these things. Thank you for this day you have made and in granting safe travels.","name":"IMG_0199.txt","index":22},{"verse":"Joshua 1:8 ESV","verseRepeat":"This Book of the Law shall not depart from yourmouth, but you shall meditate on it day and night,so that you may be careful to do according to allthat is written in it. For then you will make your wayprosperous, and then you will have good success.","blurb":"OA: When we are obedient to God, things ultimately go much better for us. God's way is the good way. P: Lord I ask your law would be written on my heart as Jeremiah prophesied that I may not depart from your will and the path you have set. Help me love others as your son loves others and to speak wisely and well. Thank you for this day you have made and for your many blessings. I ask you'd be with those in need Libby meets with and be with this country and your church.","name":"IMG_0277.txt","index":23},{"verse":"2 Samuel 7:18 ESV","verseRepeat":"Then King David went in and sat before the Lordand said, \"Who am I, 0 Lord God, and what is myhouse, that you have brought me thus far?","blurb":"OAP: God I ask you'd give me this same self forgetfulness that David has. Because who am I Lord, that you would bless me as you have. It is not by my merit that I come by such things but your grace. I have done nothing that can warrant this kind of love, but you have extended it anyway, and sent your son to atone my sins. Thank you for this great unknowable blessing Lord. You are great and thank you for this day you have made.","name":"IMG_0127.txt","index":24},{"verse":"Nehemiah 4:17 ESV","verseRepeat":"who were building on the wall. Those who carriedburdens were loaded in such a way that eachlabored on the work with one hand and held hisweapon with the other.","blurb":"OA: all of us have a task we are assigned in this life, a mission we are to strike out by the will of our God and king. We also have an enemy that will seek our destruction and failure. Possibly other man but certainly principalities. We are to be steadfast in completing the task God has set before us, but also we should be aware that an enemy is trying to foil us. P: Lord I ask for your strength and wisdom to do what is right and help me do what I am to do, and I ask you'd make me wise to the enemies plans and that their plans would fail. Thank you for this day you have made, your word, and your grace.","name":"IMG_0642.txt","index":25},{"verse":"Psalms 23:1 ESV","verseRepeat":"The Lord is my shepherd; I shall not want.","blurb":"OAP: Lord I ask that you'd make me content in your presence. You supply all my needs and through you I am made whole. There is nothing else that compares. No earthly possession, position or achievement holds a candle to your glory. In your son I have purpose. Through you I am given a purpose. I ask you'd give me wisdom and patience, and that I'd be a reflection of your son. Thank you for this day you have made.","name":"IMG_3301.txt","index":26},{"verse":"Psalms 24:1 ESV","verseRepeat":"The earth is the Lord's and the fullness thereof, the world and those who dwell therein,world and those who dwell therein,","blurb":"OAP: Lord all I have is a gift from you and belongs to you. Help me give as your son gives to those who do not warrant the gift. Instead help me love others through undeserved generosity as you love us. You have given me all I have. I ask you'd inspire in my heart a will to do the same, and discerning eyes to see how best to do it. Thank you for this day you have made and your many blessings.","name":"IMG_0200.txt","index":27},{"verse":"Psalms 24:10 ESV","verseRepeat":"Who is this King of glory? The Lord of hosts, he isthe King of glory! Selah","blurb":"OA: The Lord is our ruler. We as followers of his son who the father has lifted up above all creation is our God and king. All of creation flows from him and god is our ruler. He is our personal king and he is good and fair though his timing and thoughts are not Ours. P: God I ask you'd bring me into obedience with you, and convict me for the areas where I lack this. Help me be a good husband and worker and friend to lift up those around me. I thank you for this day you have made and your word. I ask you'd strengthen my faith and thank you for sustaining us.","name":"IMG_0326.txt","index":28},{"verse":"Psalms 25:2-3 ESV","verseRepeat":"0 my God, in you I trust; let me not be put toshame; let not my enemies exult over me. Indeed,none who wait for you shall be put to shame; theyshall be ashamed who are wantonly treacherous.","blurb":"OA: God takes care of his own. We have great hope in him and he is our rock and support and those who lean on him shall not fall, but will always rise back up in this life or the next when he makes all things right. P: God I thank you for this loving grace you extend to us. That you are a rock we can count on and lean on. Help me trust in you more and lead others to trusting in you too even when nothing makes sense. Thank you for this day you have made and for giving us safe travels you are good Lord.","name":"IMG_0332.txt","index":29},{"verse":"Psalms 27:1-3 ESV","verseRepeat":"The Lord is my light and my salvation; whom shall Ifear? The Lord is the stronghold of my life; ofwhom shall I be afraid? When evildoers assail meto eat up my flesh, my adversaries and foes, it isthey who stumble and fall. Though an armyencamp against me, my heart shall not fear;though war arise against me, yet I will beconfident.","blurb":"OAP: God I ask you'd teach me this courage and that I may point others to this same confidence as well. You are a great and secure hope to have. You are great and greatly to be praised. You are mighty and strong and worthy for us to exhibit great confidence. Thank you for this day you have made and given to us.","name":"IMG_0372.txt","index":30},{"verse":"Psalms 27:14 ESV","verseRepeat":"Wait for the Lord; be strong, and let your hearttake courage; wait for the Lord!","blurb":"OAP: God as me and Libby move out of a time of trails perhaps into more I ask you'd strengthen us both and equip us to wait in you. To seek your face when we are in distress for you are glorious beyond imagining and we were made for you and to be with you and praise your name. I ask you'd empower us for this endeavor and as we go through struggles and wait for relief from you I ask you'd teach us to wait. Thank you for this day you have made and your countless blessings.","name":"IMG_0375.txt","index":31},{"verse":"Psalms 28:9 ESV","verseRepeat":"Oh, save your people and bless your heritage! Betheir shepherd and carry them forever.","blurb":"OAP: God I ask today as well you would be a Shepard to your people for you are our strength. Without you we all can do nothing. We need you God to be effective and lights in the world. I ask you'd guide your people, that you'd teach us how to love others and glorify you by doing what you have called each of us to do for the whole body of Christ. Your will be done. I ask for wisdom and loving perspective to guide my actions with me and my fellow man. Your will be done father and thank you for this day.","name":"IMG_0376.txt","index":32},{"verse":"Psalms 31:24 ESV","verseRepeat":"Be strong, and let your heart take courage, all youwho wait for the Lord!","blurb":"OA: We now are in a state of waiting on God for Christ's return where all will be made right again. We should take courage in this fact - that God will deliver us. If not in the immediate then in the next life when Christ renews all creation. P: God I ask you'd strengthen me that I may glorify you in this short life you have given me. I ask you'd forgive me my pride and be glorified through me selflessly loving others. You are good Lord, and you've shown me great love. I ask I could do the same, being like your son, and love others selflessly. I ask your forgiveness for my pride and selfishness that still steer me often. Thank you for this day you have made and your word.","name":"IMG_0381.txt","index":33},{"verse":"Psalms 32:7 ESV","verseRepeat":"You are a hiding place for me; you preserve mefrom trouble; you surround me with shouts ofdeliverance. Selah","blurb":"OAP: You are my security and safety Lord. By your grace I stand and have success. All I have to thank for any talents or success is your hand. It is a free unwarranted gift. You are my good savior. I ask I'd honor you better. I ask forgiveness for my selfish pride. Help me serve others with no consideration for myself. Help me be selfless. Help me be like my king, Your son. I ask for wisdom and guidance to walk straight and staying within your will. Your will be done father. Thank you for this day you've made.","name":"IMG_0382.txt","index":34},{"verse":"Psalms 33:10 ESV","verseRepeat":"The Lord brings the counsel of the nations tonothing; he frustrates the plans of the peoples.","blurb":"OA: Humans often make the mistake Of thinking there is power in their own plans. But it is God that steers the date of all things. He is our king and rule whether we know him to be or not. P: God I ask you'd help me never take my Own plans all that seriously. But in all things help me first acknowledge your sovereignty. You are great lord and the way you think is not as we think. Thank you for sustaining us through hard times.","name":"IMG_0383.txt","index":35},{"verse":"Psalms 34:18 ESV","verseRepeat":"The Lord is near to the brokenhearted and savesthe crushed in spirit.","blurb":"OAP: God you are our provider and king. In you will we hope. I ask you'd be with us and with Libby as she struggles through what she is struggling through. I ask you'd be her comfort and delight. You are our life's purpose and you are good. I will trust you to lift up her broken heart and crushed spirit. You are her aid, not me. I ask you'd provide and nurture her and empower me to do whatever you'd have me do to aid her. I thank you for this day you have made and your many blessings Lord.","name":"IMG_0392.txt","index":36},{"verse":"Psalms 36:9 ESV","verseRepeat":"For with you is the fountain of life; in your light dowe see light.","blurb":"OA: through God we are given a correct perspective of things. When we see things the way he would have is seen them our perceptions snap into accuracy. And without his guidance all our perceptions are at best dull shadows. P: God I ask you'd equip my eyes to see as you would have me see, and a mind to think as you would have me think. I ask for guidance and teachers and wisdom. By your grace I grow and I ask for continued grace in this regard, and forgiveness for when I have fallen short of this. Your will be done and thank you for this day.","name":"IMG_0396.txt","index":37},{"verse":"Psalms 37:11 ESV","verseRepeat":"But the meek shall inherit the land and delightthemselves in abundant peace.","blurb":"OAP: Look I ask you'd make me into one of these meek individuals who desires peace and is content with you alone. You are great Lord and a whole life spent focused on you and being like you is a life well spent. Forgive me for often chasing for the successes of this world in my heart. You are far more valuable than any job I could do or praise I could receive. You are what stands through the ages. You endure. I ask you'd be close and your word would stay fresh in my heart. I thank you for this day you've made.","name":"IMG_0400.txt","index":38},{"verse":"Psalms 38:22 ESV","verseRepeat":"Make haste to help me, 0 Lord, my salvation!","blurb":"OAP: God, if you are not with me I have nothing. Without you I have no ground to stand on. You are my king and glory and in you alone is satisfaction everlasting. Lord I ask you'd be close to me and my family. Continue to lift us up and help me get closer to you that I may resemble more your son and be a light to others. I thank you for this day and your word. You are the alpha and omega.","name":"IMG_0401.txt","index":39},{"verse":"Psalms 39:4 ESV","verseRepeat":"\"0 Lord, make me know my end and what is themeasure of my days; let me know how fleeting Iam!","blurb":"OAP: God, we are only here on this earth for a short time, the time you have allotted to us. I ask you'd be glorified by my life, that my actions would be motivated by you, and doing your will advancing your kingdom. My life is a vapor here but you are forever Lord. Thank you for this day you have made and what it means to me and Libby.","name":"IMG_0403.txt","index":40},{"verse":"Psalms 40:6-7 ESV","verseRepeat":"In sacrifice and offering you have not delighted,but you have given me an open ear. Burnt offeringand sin offering you have not required. Then I said,\"Behold, I have come; in the scroll of the book it iswritten of me:","blurb":"OA: God desires that we desire him and long for his will and word. He does not want our money or our soul or mind, but our love and obedience. God is our good king, but he is also our loving creator and he desires relationship with his creations and for us to be mirrors of his glorious image. P: God I ask this would take root deeper in my heart. Help me be more like you and to hunger for all things you as the psalmist illustrates. You are great lord. Thank you for this day you have made and your many blessings. I ask you forgive me for losing sight of the souls of others during my conversations. I ask you'd focus in my heart and words next time. Help me bring others to you and sing your praises well and true.","name":"IMG_0404.txt","index":41},{"verse":"Psalms 41:1 ESV","verseRepeat":"Blessed is the one who considers the poor! In theday of trouble the Lord delivers him;","blurb":"OAP: Lord I ask you'd help me be a blessing to the poor, those who have not been blessed the way I have. Help me give generously the way you would have me give. Help me also provide well for my family by your grace. Guide me to help me love others and go external rather than internal. I ask for forgiveness for my selfishness. Help our family be one of love that reaches out. Thank you for this day you have made.","name":"IMG_0405.txt","index":42},{"verse":"Psalms 42:5 ESV","verseRepeat":"Why are you cast down, 0 my soul, and why areyou in turmoil within me? Hope in God; for I shallagain praise him, my salvation","blurb":"OAP: Lord though I may suffer you are still praiseworthy. Though there is much I do not understand - I know you are great and worthy of praise and all powerful and mighty and that your son died for me and through that I am before you holy. I ask you'd empower me to love others well and glorify you. Thank you for this day you have made and I ask we'd use this harder time as a time of learning and of being closer to you. Thank you for your grace and your word that nourishes me and guides me.","name":"IMG_0311.txt","index":43},{"verse":"Psalms 42:11 ESV","verseRepeat":"Why are you cast down, 0 my soul, and why areyou in turmoil within me? Hope in God; for I shallagain praise him, my salvation and my God.","blurb":"OAP: God, whenever I have hoped in you, you have delivered and sustained me. You are a good and righteous king that makes me able to conquer and supply for my family's needs. It is by your grace I can do this and all I have belongs to you. I thank you for saving my soul and for strengthening and keeping my wife. I ask you'd empower us to raise the child well and in a way that magnifies you above all that they would be a great blessing to you. Thank you for this day you have made and your will be done.","name":"IMG_0410.txt","index":44},{"verse":"Psalms 43:3 ESV","verseRepeat":"Send out your light and your truth; let them leadme; let them bring me to your holy hill and to yourdwelling!","blurb":"OAP: God you are my sight and the one in whom I trust. You are my wisdom. I ask you'd show me your path that I not deviate from it but that you would be pleased with where I go and what I do, I ask my life would be a pleasing offering to you. Thank you for this day you have made. Help me shine when in the presence of others that they might turn to you Lord and come to know you. Because you are good and worthy of praise.","name":"IMG_0412.txt","index":45},{"verse":"Psalms 44:6 ESV","verseRepeat":"For not in my bow do I trust, nor can my swordsave me.","blurb":"0: God is our real security in times of uncertainty. We are never in control of our lives or the things that will ultimately befall us, but God is our rock on which we stand. A: I should focus my mind on the glory of God in times of great distress. He is far more grand than anything here, and he dwarfs it all. Against him nothing can stand. P: God I ask the reality of your might would become clearer in my heart, and the reality of your grace. You have forgiven me of much and you go above and beyond my needs in your provision. I ask you'd be with the world now as others are scared help me help, and grant healing. Glory to you lord and thank you for this day.","name":"IMG_0477.txt","index":46},{"verse":"Psalms 46:1-3 ESV","verseRepeat":"God is our refuge and strength, a very present helpin trouble. Therefore we will not fear though theearth gives way, though the mountains be movedinto the heart of the sea, though its waters roarand foam, though the mountains tremble at itsswelling. Selah","blurb":"OAP: God you are my courage and my reason for confidence. As I face great unknowns I ask your word that I try to speak would become rooted in my heart and give me resolve. Help me stand firm though there is reason to fear. For you are my strength and help and my heart is deceitful. This world and the challenges it presents are for only a moment. But you and your hand of help endure. I thank you for your guidance and blessings. Thank you for this day you have made.","name":"IMG_0413.txt","index":47},{"verse":"Psalms 46:1-2 ESV","verseRepeat":"God is our refuge and strength, a very present helpin trouble. Therefore we will not fear though theearth gives way, though the mountains be movedinto the heart of the sea,","blurb":"OAP: Hod I pray you'd give me and Libby courage as we being to shift minds about being parents. Help give Libby a confidence not through herself but because you are with her. Please give her courage and lift her up as she tries to juggle school and baring a child. Thank you for this day and the great blessing this child represents. I ask you'd empower us to do what it is you have called us to do. Thank you for this day you have made. You are great and strong and you will take care of us and see us through.","name":"IMG_0482.txt","index":48},{"verse":"Psalms 46:10 ESV","verseRepeat":"\"Be still, and know that I am God. I will be exaltedamong the nalons, I will be exalted in the earth!\"","blurb":"OAP: God I ask you'd teach me to be still knowing that ultimately everything is under your control. Also I ask you'd help me conduct my family in a way that can point them to this as well. I ask your blessing over my family and I will trust you to provide for them, as you have always been their provider and my provider. You are my rock lord in whom I will trust. You are all that will stand the test of time and you have shown me great love and mercy in excess of what o deserve. I thank you for your provision today. In Jesus name I pray.","name":"IMG_0483.txt","index":49},{"verse":"Psalms 47:8 ESV","verseRepeat":"God reigns over the nations; God sits on his holythrone.","blurb":"OA: Though we are in a fallen world inhabited by forces of darkness, God is still in charge. He is king of all things and through Christ's actions we are children of his now - the king of all creation. We have reason to be confident and to glorify God. Even while we are in a world that is so flawed. P: God you are king over all the earth. You placed the earth in its place and set it in motion. You and wonderfully creative Lord and what you have made is amazing. I thank you for all of it we get to see through travel and discovery - learning and delighting in your creation. Thank you for this day you have made, for health, and your saving grace.","name":"IMG_0485.txt","index":50},{"verse":"Psalms 49:5-7 ESV","verseRepeat":"Why should I fear in times of trouble, when theiniquity of those who cheat me surrounds me,those who trust in their wealth and boast of theabundance of their riches? Truly no man canransom another, or give to God the price of his life,","blurb":"OAP: God thank you for this season of comfort and relaxation you have blessed me with. I ask with my renewed energy and resources that I'd lift up others in a way that pleases you. Help me lift up and support Libby, give to those in my community with great need, and glorify you through my words and deeds. My security is not is my present comfort or my wrath but you God. You are my rock and you cannot be moved. Though everything around me may fall you never will. Thank you for this day you have made and this reminder. In Jesus name I pray.","name":"IMG_0486.txt","index":51},{"verse":"Psalms 49:17 ESV","verseRepeat":"For when he dies he will carry nothing away; hisglory will not go down after him.","blurb":"OA: All the riches one can achieve, all the material possessions one can hope to attain are only here for a moment. This life is only for a moment, and God is the constant that remains, not the things of this earth. P: Lord I ask you'd forgive me my idolatry for the things of this world and that you'd refocus my mind on glorifying and serving you. I thank you for this day you have made and the many blessings you have given me.","name":"IMG_0416.txt","index":52},{"verse":"Psalms 50:14-15 ESV","verseRepeat":"Offer to God a sacrifice of thanksgiving, andperform your vows to the Most High, and call uponme in the day of trouble; I will deliver you, and youshall glorify me.\"","blurb":"OAP: God thank you for the great blessings you have poured out over my life. You have been my constant help in my time of need and you have always been there for me through the good and bad times. You have saved me and my family. You have blessed me with a saving grace so great I can not comprehend it. Thank you Lord. All I have is yours and because of you. Thank you for this day you have made. In your sons name I pray, amen.","name":"IMG_0418.txt","index":53},{"verse":"Psalms 50:23 ESV","verseRepeat":"The one who offers thanksgiving as his sacrificeglorifies me; to one who orders his way rightly I willshow the salvation of God!\"","blurb":"OA: We often have much to be grateful for that God has provided to us. First and foremost he has saved us through his Son, already a gift without measure, but in addition he supplies all our needs, is our rock when times are uncertain, and is our deliverer. God is good and worthy to be praised joyfully. P: God I ask that even when I do not feel joyful that you will help my heart remember your good news and praise you through gloom and sadness. You are great and in this time of uncertainty you stand strong while all else may fade away. Thank you for this day you have made and your many blessings.","name":"IMG_0488.txt","index":54},{"verse":"Psalms 51:12 ESV","verseRepeat":"Restore to me the joy of your salvation, and upholdme with a willing spirit.","blurb":"OAP: God I ask you'd show me in a deeper way in my heart the tremendous gift I have been given. You are my provider and my strength. You have saved me from the other of self destruction I was on and you've placed in me a new heart that is beginning to see truth, and glorify you. I ask these truths would penetrate deeper and that awareness of your greatness would always be on my mind. Thank you for this day you have made. Help me glorify you.","name":"IMG_0421.txt","index":55},{"verse":"Psalms 51:17 ESV","verseRepeat":"The sacrifices of God are a broken spirit; a brokenand contrite heart, 0 God, you will not despise.","blurb":"OAP: Lord I come before you in prayer sinful with many flaws and blessed beyond measure by you and the gift of your salvation. I also come before you with my worries, anxieties, and the great illness Libby is going through. I ask for healing and comfort. Please help it be easier for her Lord. I ask you show us grace beyond what we deserve and help my wife and the baby within her stay healthy. Please guide my actions to be to their benefit. Help me not smother my wife with concerns but love her and lift her up, while still allowing her to stand on her own two feet. Help me make good decisions on behalf of her and the baby in her. But not my will but your will be done. And no matter what Lord, you are holy and worthy of praise though it's rough now. You are great and this life is short.","name":"IMG_0489.txt","index":56},{"verse":"Psalms 52:7 ESV","verseRepeat":"See the man who would not make God hisrefuge, but trusted in the abundance of hisriches and sought refuge in his owndestruction!","blurb":"OAP: Lord I ask you'd keep me from making this same mistake. Help me seek my refuge in you alone for you provide my needs. Though I may not eat mana every day - it is still your grace that puts food on the table. You provide our every need and you allow me to play a part in the provision as a blessing to me. I thank you for this lord and lift you up as my source and shield from destruction. Thank you for this day you have made and I ask you'd give me wisdom to lead my family and act rightly.","name":"IMG_0493.txt","index":57},{"verse":"Psalms 53:2-3 ESV","verseRepeat":"God looks down from heaven on the children ofman to see if there are any who understand, whoseek after God. They have all fallen away; togetherthey have become corrupt; there is none who doesgood, not even one.","blurb":"OAP: God I ask you'd give me understanding about how to balance this tendency in man also with your light shining through the unsaved. You are good God, and a light to our feet. You are our rock and sturdy foundation. On you alone, and nothing of this world, do we lean and can we count on. Riches fade. Fame fades. Praise fades, but your glory is eternal. Help me always have this sense of scale and look to you, not other men, for my purpose and drive. Thank you for this day you have made and glory to you.","name":"IMG_0439.txt","index":58},{"verse":"Psalms 53:6 ESV","verseRepeat":"Oh, that salvation for Israel would come out ofZion! When God restores the fortunes of hispeople, let Jacob rejoice, let Israel be glad.","blurb":"OA: God has restored the fortunes of his people through Christ and his sacrifice giving us a wealth in treasure that is beyond this world in eternal grace. We should show gratitude to God and love to others in honor of this priceless gift we have been given. P: God I ask you'd help me love others as you do and thank you for the immeasurable gift of your salvation. You are good Lord and I am blessed. Thank you for this day.","name":"IMG_0494.txt","index":59},{"verse":"Psalms 55:22 ESV","verseRepeat":"Cast your burden on the Lord, and he will sustainyou; he will never permit the righteous to bemoved.","blurb":"OAP: Lord you are my only safe refuge. All other things in this world will fail me and only you will stand forever. You are mighty and great and will stand through the ages. Help me remember to always cast my burden on you for you can easily shoulder it and are faithful. Thank you for this day you have made and the way you have blessed me God beyond measure. Help me likewise be a blessing to others and glorify you.","name":"IMG_0497.txt","index":60},{"verse":"Psalms 56:11 ESV","verseRepeat":"in God I trust; I shall not be afraid. What can mando to me?","blurb":"OA: there is nothing to fear in this life when we have the Lord by our side. No creation of man or act of nature can stand up to our God who is eternal. No principality, or demonic force can hold a candle to my God whom I serve. P: God I ask you'd give me courage and strength and wisdom. Help me walk through this life as one of your children, love and serving you and the others you have placed in my life to reflect your son. Thank you for this day you've made and the time I've had with my wife and for giving us a pregnancy. I ask for health over this new life - that we'd have a healthy child that we raise for your glory.","name":"IMG_0446.txt","index":61},{"verse":"Psalms 57:11 ESV","verseRepeat":"Be exalted, 0 God, above the heavens! Let yourglory be over all the earth!","blurb":"OA: As followers of God we are to seek that he be glorified everywhere and sing his praises whenever we can. God is good and our life's work is to reflect his glory and direct others to him. P: God glory to you. Thank you for all the things you've blessed me with - and for your word and also the gifts you've given those in the past to write so well that I can enjoy today. Thank you for this day you have made, for health, and for time with my wife. In your name I pray, amen.","name":"IMG_0499.txt","index":62},{"verse":"Psalms 59:16 ESV","verseRepeat":"But I will sing of your strength; I will sing aloud ofyour steadfast love in the morning. For you havebeen to me a fortress and a refuge in the day of mydistress.","blurb":"OA: Though forces of man and forces of darkness align themselves against God's children - we have him as our fortress and refuge. There is nothing for us to fear. God has already won the fight. P: Lord thank you for you're unfailing provision. You are my strength and help in time of need. With you by my side my family cannot be shaken. Thank you for this day you have made and your word. In Jesus name I pray - amen.","name":"IMG_0504.txt","index":63},{"verse":"Psalms 60:11 ESV","verseRepeat":"Oh, grant us help against the foe, for vain is thesalvation of man!","blurb":"OA: when our help comes from man it is no real help at all. Man is so small and even our best efforts are small compared to acts of God. When God comes to our aid however we cannot fail. And with him behind us nothing will overcome us. P: God I ask you'd be my support and provider. Thank you for being with us to the extent that you have. You have been our salvation in time of need. I ask you'd stay close to us in this stressful time and help us do what is right and wise. In Jesus name I pray, amen.","name":"IMG_0506.txt","index":64},{"verse":"Psalms 60:12 ESV","verseRepeat":"With God we shall do valiantly; it is he who willtread down our foes.","blurb":"OA: When God is with us we will always triumph in the end. Though we may suffer momentarily - when this world passes away God will make all things clear and bring justice and wipe away all tears of his children. P: Lord you are my salvation and my strength. I ask you'd bring more into your family and help me do whatever I can to help contribute. Help me use all the talents you have given me and those you have placed in my life that I may glorify you and have others see you for who you are. Thank you for this day and your many blessings. In Jesus name I pray, amen.","name":"IMG_0448.txt","index":65},{"verse":"Psalms 62:9 ESV","verseRepeat":"Those of low estate are but a breath; those of highestate are a delusion; in the balances they go up;they are together lighter than a breath.","blurb":"OAP: God help me never stumble into believing as the world believes and seeking the things of this world. You are my refuge and strength. You are the only constant in a crazy world. You also are my rock. When I can stand strong and not under delusions, it is you that makes me able to stand. Because of you I can face the challenges that await me in life. You strengthen my hand and help me become better. I thank you for this day you have made and ask for your wisdom and guidance in all I do.","name":"IMG_0449.txt","index":66},{"verse":"Psalms 63:5-6 ESV","verseRepeat":"My soul will be satisfied as with fat and rich food,and my mouth will praise you with joyful lips, whenI remember you upon my bed, and meditate on youin the watches of the night;","blurb":"OAP: Lord you are more than enough for me. If I had the whole world known to mortal man but do not have you and right relationship with you, I have nothing. But with you Lord I have wealth beyond measure. And your son enables me to achieve this. This gift of infinite worth I can never understand and I praise you for it. Thank you for this day you have made.","name":"IMG_0450.txt","index":67},{"verse":"Psalms 63:5-6 ESV","verseRepeat":"My soul will be satisfied as with fat and rich food,and my mouth will praise you with joyful lips, whenI remember you upon my bed, and meditate on youin the watches of the night;","blurb":"OA: God is all we really need to be satisfied. Though our treasures may fade and our relationships go south - God is the rock that we can stand on and not be moved. All other things will be tested and found wanting but God will not. He is our joy and we are his. P: Lord thank you for your love and grace. You are great Lord with mighty seed and love and wisdom. You are perfection and that standard by which all truth is determined. I thank you for revealing your truths to me and I ask you'd equip me to share and help others in their sharing. You are great and greatly to be praised. I thank you for this day you have made and your many blessings.","name":"IMG_0510.txt","index":68},{"verse":"Psalms 65:9 ESV","verseRepeat":"You visit the earth and water it; yougreatly enrich it; the river of God is full ofwater; you provide their grain, for so youhave prepared it.","blurb":"OAP: God you are the source of all good things. Thank you for blessing me so tremendously. You are good to me and have saved my soul. Glory to you lord because it is by you that my family is provided for. All I have is yours and belongs to you. I ask for your guidance and blessings over the choice I may have before me. Help me speak well and act honorably. Thank you for this day you have made. In Jesus name I pray. Amen.","name":"IMG_0512.txt","index":69},{"verse":"Psalms 67:1-2 ESV","verseRepeat":"May God be gracious to us and bless us and makehis face to shine upon us, Selah that your way maybe known on earth, your saving power among allnations.","blurb":"OAP: Lord you have blessed me tremendously. Above all through my salvation, but also in all realms with a good family, wife, job. There is nothing I have lacked. You are my provider and my redeemer and I ask that you'd be on my mind often - because when I think of you Lord all things are better. Thank you for this day you have made and your word. Help me better sing your praises to others honestly and in a way that can turn some to you by your grace.","name":"IMG_0513.txt","index":70},{"verse":"Psalms 68:35 ESV","verseRepeat":"Awesome is God from his sanctuary; the God ofIsrael—he is the one who gives power and strengthto his people. Blessed be God!","blurb":"OA: Without God, the people of God, the church are powerless and struggle in vein against a cold and evil world. But with God behind us we will be triumphant in the end against all things we face. God empowers us to do great things and he is doing great things. P: God you are our source and might. You support all creation and you are worthy of praise. Your mercy and grace have no equal. Thank you for this day and your word Lord.","name":"IMG_0514.txt","index":71},{"verse":"Psalms 71:18 ESV","verseRepeat":"So even to old age and gray hairs, 0 God, do notforsake me, until I proclaim your might to anothergeneration, your power to all those to come.","blurb":"OAP: Lord I ask that as me and Libby are preparing to be parents that you'd help us proclaim your might to the next generation, especially our own child Lord. Help us in word and deed sing your glory to them that they too would come to know you as their rock in a shakeup world - as a comfort when no other comfort can be found. You are great Lord, and thank you for this day.","name":"IMG_0519.txt","index":72},{"verse":"Psalms 119:45 ESV","verseRepeat":"and I shall walk in a wide place, for I have soughtyour precepts.","blurb":"0: When we keep in line with God's word we are placed firmly away from many pitfalls, on a \"wide place.\" A: cling to Gods will and flee from all sin so that you will be secure in your steps. Do not approach a place where you could stumble be flee to safe grounds when it comes to matters of the soul. P: God I ask you'd lead me far away from that which would seek to destroy all of me, present and eternal future. Give me wisdom that I may avoid pitfalls, and love that I may not be proud. Help me embody your son, my king, during this life. Thank you for this day and your many blessings.","name":"IMG_0183.txt","index":73},{"verse":"Psalms 119:90-91 ESV","verseRepeat":"Your faithfulness endures to all generations; youhave established the earth, and it stands fast. Byyour appointment they stand this day, for all thingsare your servants.","blurb":"OAP: Lord you have set the world in motion. Our whole universe is in that palm of your hand. You spoke the world itself into existence. Help me remember this when I am faced with hopelessness or fearfulness. You are the creator of all things and you have and do love me more than I can understand. You, the same that spoke the sun and this galaxy into existence have also shown me love and forgiveness though I fell so short and still do. Glory to you Lord for your great mercy and grace to me. You are great and greatly to be praised. Thank you for this day you have made and the gift of your word.","name":"IMG_0185.txt","index":74},{"verse":"Psalms 119:96 ESV","verseRepeat":"I have seen a limit to all perfection, but yourcommandment is exceedingly broad.","blurb":"OAP: God I ask you'd help me see better the greatness in your word and precepts. I ask like the psalmist I would see your word as the endless supply that it is. I thank you for your many blessings with your word so far and how it has a lifetime of things to teach. Thank you for the day and this great time with family.","name":"IMG_0188.txt","index":75},{"verse":"Proverbs 10:19 ESV","verseRepeat":"When words are many, transgression is notlacking, but whoever restrains his lips is prudent.","blurb":"OAP: God I ask you'd help me speak wisely and thoughtfully when I speak. Help me consider my words carefully. Thank you for blessing me with good friends family and wife and thank you for blessing Libby with that good work day. I ask you'd guide her heart to what you would have her do and that I not stand in the way but be a force that helps push her along your path as she dies the same for me. Thank you for this day and my many blessings.","name":"IMG_0029.txt","index":76},{"verse":"Proverbs 11:1 ESV","verseRepeat":"A false balance is an abomination to the Lord,but a just weight is his delight.","blurb":"OAP: Lord I ask I never compromise an inch when it comes to wronging another for personal gain. I ask my heart would be sensitive to this Lord and that you would guard me from corrupting temptations that would seek to erode my heart. May my deeds We         And III IIIIIU •   • • • • • • • • •    • • • • • • • • 1I","name":"IMG_3178.txt","index":77},{"verse":"Proverbs 11:26 ESV","verseRepeat":"The people curse him who holds back grain,but a blessing is on the head of him who sellsit.","blurb":"OAP: Lord help me only keep what is wise like the ants in the winter, but have me give what remains away. Convict me when I grow too attached to the gifts you have given me and lose sight of you and others. Help me be generous in a way that pleases and glorifies you and that shields me from greed. Help me know what is right and good and thank you for this day.","name":"IMG_3183.txt","index":78},{"verse":"Proverbs 12:18 ESV","verseRepeat":"There is one whose rash words are like swordthrusts, but the tongue of the wise brings healing.","blurb":"God I ask I would speak words of healing over those I interact with. I ask you'd help me build up what is good and be liberal with praise when the good I see is from you and worthy of praise. Help me lift someone up when they are acting as you would have them act so that I be a wind in their sails as they move to you. Thank you for this day and how you have blessed me lord.","name":"IMG_0031.txt","index":79},{"verse":"Proverbs 12:28 ESV","verseRepeat":"In the path of righteousness is life, and in itspathway there is no death.","blurb":"OAP: God I ask you'd help me stay in the path of righteousness that I not deviate though times are hard and I do not know what the future will hold. Help me do what is good in your sight, and pleases you. Please be with my father and mother and give us all rest today, and give dad patience with us and continue to work on his soul, though he has been reduced. Be savior and healer I ask Lord. In Jesus name, amen.","name":"IMG_3190.txt","index":80},{"verse":"Proverbs 13:11 ESV","verseRepeat":"Wealth gained hastily will dwindle, butwhoever gathers little by little will increase it.","blurb":"OAP: Lord help me be content with small and steady progress that I not gain something hastily. I ask that you keep me from stumbling as many do when they ascend too quickly and do not learn along the way. Your will be done Lord. Make me seek after you and content with my lot of worldly things for my worldly desires. Thank you for this day.","name":"IMG_3185.txt","index":81},{"verse":"Proverbs 14:4 ESV","verseRepeat":"Where there are no oxen, the manger is clean, butabundant crops come by the strength of the ox.","blurb":"0: If we take on no responsibility life is easy, but also to do something meaningful and good means taking on responsibility. The stale needs some ox to do good work, even if that makes things messy. A: I should be willing to put up with some stressors in life because they come from trying to do good sometimes. P: help me strike this balance and live life wisely in light of this proverb lord. Help me not take on unnecessary stressors but also help me help others and all that entails, stressor or no. Thank you for this day and time with family.","name":"IMG_0035.txt","index":82},{"verse":"Proverbs 14:13 ESV","verseRepeat":"Even in laughter the heart may ache, and theend of joy may be grief.","blurb":"OAP: Lord I ask on this sad day that you'd comfort my family. Strengthen our faith and give us courage to act well in a way that honors you during the hard days we will face in this fallen world. Please bring healing to my father and I ask you'd be glorified as healer. Thank you for this day you have made and glory to you.","name":"IMG_3188.txt","index":83},{"verse":"Proverbs 14:30 ESV","verseRepeat":"A tranquil heart gives life to the flesh, but envymakes the bones rot.","blurb":"OAP: Lord first I'd like to thank you for the inspiring family you have given me. I ask you'd continue to strengthen and keep them and I praise you for what you have done and are doing. I ask you'd protect me from envy and greed, that I'd be shielded from foolish thoughts and lusts. I ask I'd be in the world but not of it. I ask you'd make in me a tranquil heart that glorifies you above all and I thank you for this day you have made. You are good.","name":"IMG_0032.txt","index":84},{"verse":"Proverbs 14:31 ESV","verseRepeat":"Whoever oppresses a poor man insults hisMaker, but he who is generous to the needyhonors him.","blurb":"0: how we treat the poor and destitute among us is how we treat God their maker. A: To honor God we should honor those that are cast down among us, and give them the honor due one made in the image of God and loved by Christ on the cross. P: God, help me see people this way. Help me see them as you see them that I can honor them in a way that brings honor to you. Thank you for this day Lord and glory to you.","name":"IMG_3191.txt","index":85},{"verse":"Proverbs 15:3 ESV","verseRepeat":"The eyes of the Lord are in every place,keeping watch on the evil and the good.","blurb":"OAP: Lord you see everything. The good and the bad. The hurt and the joy. And your son loves as one of us and took on our rightful suffering. You know us deeply lord. You know what my father and mother are going through and you look at it through the lens of eternity. I ask you'd give my parents eyes to see it in the same way, that you'd make them know your grace and love in their great pain. Thank you for this day you have made, and for giving my father so much life left that he was not taken from us lord. You are good.","name":"IMG_3192.txt","index":86},{"verse":"Proverbs 15:7 ESV","verseRepeat":"The lips of the wise spread knowledge; not so thehearts of fools.","blurb":"OAP: God I ask you'd help me strike a balance between sharing knowledge so that others can be informed but also that I don't over share and make them deaf to what I have to say. Help me not over step this boundary but manage it wisely and please you through teaching others as well as being silent when I should. Thank you for this day you have made.","name":"IMG_0036.txt","index":87},{"verse":"Proverbs 16:2 ESV","verseRepeat":"All the ways of a man are pure in his own eyes, butthe Lord weighs the spirit.","blurb":"0: Everyone, including me, will have a particular view of ourselves that is inaccurate, and my instinct will be to defend myself. But god sees what is real and what is not. A: I should reflect on my self perception enough to know it likely is inaccurate and gives me way too much credit. P: God I ask I not seek to self justify, but instead seek to be more like you. Help me not stagnant but continue to go after you becoming more like your son, my king. Thank you for this day you have made and your countless blessings.","name":"IMG_0037.txt","index":88},{"verse":"Proverbs 16:3 ESV","verseRepeat":"Commit your work to the Lord, and your plans willbe established","blurb":"OAP: God I ask you'd teach me better what it means to do this and I thank you for the many privileges you have given me to do good work and to be of aid to others. Help me be a better help to my community, coworkers, wife and family. I ask you'd establish the work of my hands for all I have and will have is already yours. Help what I do glorify you and guide me to the right path. Thank you for this day you have made and your word that nourishes me daily.","name":"IMG_0209.txt","index":89},{"verse":"Proverbs 16:3 ESV","verseRepeat":"Commit your work to the Lord, and your planswill be established.","blurb":"OAP: Lord I ask you'd steer my heart that all I do would be done unto you. That you would be glorified by my life and my work. Help it be for you and not me and convict and correct me when I stray into selfish priorities. Help me do good in your sight lord.","name":"IMG_3194.txt","index":90},{"verse":"Proverbs 17:9 ESV","verseRepeat":"Whoever covers an offense seeks love, but hewho repeats a matter separates close friends.","blurb":"OAP: Lord, I ask you'd help me be a man who covers offenses rather than one who repeats things. Help me love as you love and to keep no record of wrongs in marriage or in any of my relationships. But to be where conflicts end. Help me not pay back wrong for wrong but reply in love to wrong. Thank you for this day you have made Lord.","name":"IMG_3196.txt","index":91},{"verse":"Proverbs 17:28 ESV","verseRepeat":"Even a fool who keeps silent is considered wise;when he closes his lips, he is deemed intelligent.","blurb":"OAP: God I ask you'd help me only speak when I ought to and to keep silent all other times in accordance with your will. Help me not over share or be presumptuous in what I should say. Instead I ask you'd guide the words of my mouth to be few but if high quality and that I only speak things that are in love to lift up and toward you in some small way. Help me speak better about you and as a representative of your son. Thank you for this day you have made and your many blessings.","name":"IMG_0038.txt","index":92},{"verse":"Proverbs 18:1 ESV","verseRepeat":"Whoever isolates himself seeks his own desire; hebreaks out against all sound judgment.","blurb":"OAP: I ask you'd help me not isolate myself from wise council or others in general. Help me be receptive to wisdom and thank you for the wife you have blessed me with that can steer me toward wisdom and what is good. Thank you for this day you have made. Help me be slow to speak and quick to listen and help me control my anger so that I not misrepresent your son","name":"IMG_0039.txt","index":93},{"verse":"Proverbs 18:9 ESV","verseRepeat":"Whoever is slack in his work is a brother tohim who destroys.","blurb":"OAP: Lord help me never slack in my work but to work hard and well for those whose wage provides for me and Libby. Help me be a blessing to my employer and to glorify you in the process by working well. Glory to you lord, it is by your grace I have talents. I ask I always use them well.","name":"IMG_3199.txt","index":94},{"verse":"Proverbs 18:10 ESV","verseRepeat":"The name of the Lord is a strong tower; therighteous man runs into it and is safe.","blurb":"OAP: Lord I ask you'd turn my heart to you that I run to you and not the things of this world for security. And I ask you'd be with my parents during this very hard time and be their security and strength that they would run to you and not your own understanding. Help me to aid them however I can but to leave what I can do nothing about to you Lord. Help me run to your name in my time of trouble and glory to you","name":"IMG_3231.txt","index":95},{"verse":"Proverbs 19:2 ESV","verseRepeat":"Desire without knowledge is not good, andwhoever makes haste with his feet misses hisway.","blurb":"OAP: Lord I ask you'd help me slow down and not rush things foolishly. I am not in a hurry Lord for your son has bought me. There is no great fear that I run from for you have saved my soul. I ask you forgive me for my folly in often thinking I need to rush in order to get by. Thank you for this day you have made and how you have blessed me and Libby.","name":"IMG_3203.txt","index":96},{"verse":"Proverbs 19:27 ESV","verseRepeat":"Cease to hear instruction, my son, and you willstray from the words of knowledge.","blurb":"OAP: God I ask I not make this mistake of closing myself off to knowledge that others may have for me no matter what age I grow into. Help me always remember that there is far more that I do not know than I know, and to not cut myself off for what others may have for me. Help me never be blinded by pride from valid reproductive, but to consider and discern the truth of the thing. Thank you for this day you have made.","name":"IMG_0047.txt","index":97},{"verse":"Proverbs 20:6 ESV","verseRepeat":"Many a man proclaims his own steadfast love,but a faithful man who can find?","blurb":"0: in this life most people will say one thing and do another. Proclamations of love are common, but steadfast love is rare. A: I should be someone genuine that seeks the truth and speaking what is right and honest. P: God, help me be a man of integrity that speaks only what is true or does not speak at all. Help me be one who shows steadfast love and not only speak it. Thank you for this day Lord and glory to you.","name":"IMG_3209.txt","index":98},{"verse":"Proverbs 21:2 ESV","verseRepeat":"Every way of a man is right in his own eyes,but the Lord weighs the heart.","blurb":"OAP: God I ask you'd give me eyes to see the world as you do. That I not view the world through my worldly eyes but through your just and right eyes. I know my heart will deceive me but I ask that your wisdom would cut through all that and help me see truth. Thank you for this day and many blessings lord. Amen.","name":"IMG_3216.txt","index":99},{"verse":"Proverbs 21:13 ESV","verseRepeat":"Whoever closes his ear to the cry of the poor willhimself call out and not be answered.","blurb":"OA: who are we to seek God in our time of need when we ourselves fail to do the Christ like thing of helping those others that cry out for help. We should come to the aid of others with the same tenacity we come to our own aid. P: God I ask you'd help me do this. Help me see these moments when they are before me, and to help those others who are in need to n keeping with how your son helped us though we were poor in spirit. Thank you for this day you have made and this time with my wife.you are good lord.","name":"IMG_0048.txt","index":100},{"verse":"Proverbs 22:16 ESV","verseRepeat":"Whoever oppresses the poor to increase hisown wealth, or gives to the rich, will onlycome to poverty.","blurb":"OAP: God, I ask I never be tempted to impress those above or those who are rich. Help me not participate in the rat races but instead be generous, hard working, and loving. Give me clarity of mind on this and help me see everyone as valuable as I see myself, not only those I consider at or above my station.","name":"IMG_3219.txt","index":101},{"verse":"Proverbs 22:24 ESV","verseRepeat":"Make no friendship with a man given to anger, norgo with a wrathful man,","blurb":"OA: I should avoid spending much time with grumpy men, or with bitter men, but seek the company of those who will steer me to be more like Christ, so that I can know him more over time grow to be more like him, rather than grow more distant and angry. P: God please help me put this into practice and avoid the company of angry men, and instead seek good council for my life that is calm and humble.","name":"IMG_0062.txt","index":102},{"verse":"Proverbs 23:1-3","verseRepeat":"When you sit down to eat with a ruler,observe carefully what is before you, and puta knife to your throat if you are given toappetite. Do not desire his delicacies, for theyare deceptive food.","blurb":"0: when we see the fruits of great wealth we are in danger of falling into temptation of jealousy and greed. A: Similar to how in other realms of life I look away to avoid temptation, great wealth is no different. When it is before me I will be under great temptation and must look away. P: help me be wise about avoiding this temptation and the author of the proverb instructs. Help me never envy or seek wealth, but instead glorify you and be like your son in my love for others. Thank you for this day you have made Lord. Thank you for giving Libby a good day. I ask you'd be with","name":"IMG_3221.txt","index":103},{"verse":"Proverbs 25:27 ESV","verseRepeat":"It is not good to eat much honey, nor is itglorious to seek one's own glory.","blurb":"OAP: God I ask your forgiveness for when I have daughter my own glory rather than your glory. You are my source and you are the center, not me lord. I ask you'd steer me to glorify you. Help me do this everyday and to love my neighbor as your son does and to be wise in my Acts. Thank you for this day and glory to you Lord.","name":"IMG_3223.txt","index":104},{"verse":"Proverbs 26:20 ESV","verseRepeat":"For lack of wood the fire goes out, and wherethere is no whisperer, quarreling ceases.","blurb":"0: if you do not fuel strife with double talk and passive aggression and talking behind others backs it dwindles. A: seek to end strife where it arises by putting an end to whispering against another at least when in your presence. I should not listen to such things so that I do not get pulled into it as well. P: God help me prevent strife, not to stir it up. Help it end at me and go no further and help me avoid whispering of others and me hearing the whispering of others that I not get pulled in to those things","name":"IMG_3224.txt","index":105},{"verse":"Proverbs 27:18 ESV","verseRepeat":"Whoever tends a fig tree will eat its fruit, and hewho guards his master will be honored.","blurb":"OAP: God I ask you'd make me a good servant to my earthly masters, that I would represent you well in my service to them. That I would have straight dealings and that pride would be far from me. And above that Lord, I ask you'd make me into a good servant of you, my ultimate master above all things. Help me glorify you above all other things and shape the desires of my heart to this end. You are all that matters and I thank you for this day you have made.","name":"IMG_0129.txt","index":106},{"verse":"Proverbs 27:20 ESV","verseRepeat":"Sheol and Abaddon are never satisfied, and neversatisfied are the eyes of man.","blurb":"OAP: God I ask I not succumb to this common fault in man that nothing is ever enough. You are enough Lord, and nothing else in this world can satisfy. I ask you'd instill this in my heart and how I live. You are my king and my God. I ask you forgive me for so often chasing after the wind. Thank you for this day you have made and your many blessings.","name":"IMG_0128.txt","index":107},{"verse":"Proverbs 27:23 ESV","verseRepeat":"Know well the condition of your flocks, andgive attention to your herds,","blurb":"OAP: Lord I ask you'd help me plan long term as is appropriate for a man of a household. There is more I cannot control then I can, but help me do what is wise and responsible and the rest help me give away generously. Thank you for this day you have made Lord and for safe travels.","name":"IMG_3227.txt","index":108},{"verse":"Proverbs 28:26 ESV","verseRepeat":"Whoever trusts in his own mind is a fool, buthe who walks in wisdom will be delivered.","blurb":"OAP: Lord I ask you'd always remind me to never trust in my own mind but to lean in your wisdom and the example set by your son and your word for my guidance. My mind is weak and my flesh is weaker, but your love is strong, and with your aid I can do great things and love others as your son does. Help me do this better Lord, to not lean on my own understanding and glorify you. Thank you for this day you have made and I ask your grace and mercy be with my parents","name":"IMG_3228.txt","index":109},{"verse":"Proverbs 29:20 ESV","verseRepeat":"Do you see a man who is hasty in his words?There is more hope for a fool than for him.","blurb":"OAP: Lord I ask you'd make me slow to speak, so that I not speak foolishness in haste. Help what I say be honorable to you and loving to my fellow man, and to never be in a hurry to speak. Help me be patient in this, and hold my tongue. Thank you for this wise word lord and thank you for this day you have made.","name":"IMG_3233.txt","index":110},{"verse":"Proverbs 30:33 ESV","verseRepeat":"For pressing milk produces curds, pressingthe nose produces blood, and pressing angerproduces strife.","blurb":"OAP: Help me have a better grasp on my anger Lord. Help me be slow to anger and to reduce strife not increase it. Teach me how to diffuse angry except for what is strictly appropriate. Please help me be wise in hard conversations with my wife and to glorify you with my words. Thank you for this day you have made Lord.","name":"IMG_3236.txt","index":111},{"verse":"Ecclesiastes 3:20 ESV","verseRepeat":"All go to one place. All are from the dust, and todust all return.","blurb":"OAP: Lord I ask that the unavoidable death in this life would be on my mind that I not take this life too seriously. My time here is short and beyond this life lies eternity. Help me never serve anything here or be too distracted by the small things of this world but help me keep my heart faced towards you. Help me avoid sin and to love others as your son did. Thank you for this day you have made and glory to you. I am from dust and to dust I will return, but by your grace I have been made one of your children. Help me remember all this and thank you for your word.","name":"IMG_0566.txt","index":112},{"verse":"Ecclesiastes 4:4 ESV","verseRepeat":"Then I saw that all toil and all skill in work comefrom a man's envy of his neighbor. This also isvanity and a striving after wind.","blurb":"0: Often what motivates a man to work hard is nothing but simple pride and envy. And so all he does and all he advances in is vanity. A: I should be quick to identify this in myself and turn from it that I might not make the mistake of squandering what time the Lord has given me in sin. P: God I ask you'd help me see this in myself when it is happening that I could see when what is truly motivating me is envy and selfishness. Help me turn from this and I ask your forgiveness for all the times I've done this. Thank you for your word this day and all your many blessings.","name":"IMG_0567.txt","index":113},{"verse":"Ecclesiastes 5:19 ESV","verseRepeat":"Everyone also to whom God has given wealth andpossessions and power to enjoy them, and toaccept his lot and rejoice in his toil—this is the giftof God.","blurb":"OAP: Lord I ask you'd teach me contentment and service. Help me enjoy what I have and be glad in it. Help my ambitions not be foolish and for my will to be a reflection of your own. I often only want more as the author explains here. Help me resist this worldly urge and instead commit to thinking about how I can serve you and others with what it is I do have. Thank you for this day you have made and your word.","name":"IMG_0568.txt","index":114},{"verse":"Ecclesiastes 6:7 ESV","verseRepeat":"All the toil of man is for his mouth, yet his appetiteis not satisfied","blurb":"OA: when chasing after earthly things there is no end to what you will strive for. For that reason one should strive to be content with what they have and while not turning down good opportunities - one should not expect them to fulfill. Only God can fulfill and give rest. P: Lord I ask you'd give me contentment. You are my Lord. It's you whom I serve first and foremost. You are my joy and delight. I ask you'd remove any clouds in my mind confusing me and pulling me to reed and vain ambition. Help me do good and thank you for this day you have made Lord. In Jesus name I pray. Amen.","name":"IMG_0571.txt","index":115},{"verse":"Ecclesiastes 7:14 ESV","verseRepeat":"In the day of prosperity be joyful, and in the day ofadversity consider: God has made the one as wellas the other, so that man may not find out anythingthat will be after him.","blurb":"OAP: God I ask when times of adversity come I would consider that you are God, my fate is in your hands, and I am a finite man that is dependent on you. You are my support and strength and without you I have nothing. Thank you for this day you have made Lord. For the health of my wife and unborn child. You are glorious and worthy of praise.","name":"IMG_0573.txt","index":116},{"verse":"Ecclesiastes 8:16-17 ESV","verseRepeat":"When I applied my heart to know wisdom, and tosee the business that is done on earth, how neitherday nor night do one's eyes see sleep, then I sawall the work of God, that man cannot find out thework that is done under the sun. However muchman may toil in seeking, he will not find it out. Eventhough a wise man claims to know, he cannot findit out.","blurb":"OA: No matter how much we strive to understand all things and to understand God and what he is doing - there will still be a great many mysteries that we do not know the answers to. God and his mind is far beyond our own. And man is so limited in his grasp of things. We cannot trust our hearts for they are deceptive and our minds are very limited. But we serve a good God we can trust so even though we face great unknowns - God is with us and we can have peace. P: Lord I ask this fact would be on my heart and that I would never be overly confident in what I cannot truly know and help me trust you more. For you are the only constant in this world. Thank you for this day you have made.","name":"IMG_0575.txt","index":117},{"verse":"Ecclesiastes 8:17 ESV","verseRepeat":"then I saw all the work of God, that man cannotfind out the work that is done under the sun.However much man may toil in seeking, he will notfind it out. Even though a wise man claims to know,he cannot find it out.","blurb":"0: No man, only God knows the future. A: Have faith in God not yourself to predict the future. I will never know what lies ahead nor any man. But God is good and his plans are far greater than mine so I can have confidence that what will be in the end will be good. P: God, you alone know what is to come. Help me have wisdom to do the best I can but also help me never lean too hard on my own limited understanding. I ask you give me faith to face the unknowns in life. Help me serve and love others. And help me be a good father and husband. You are great Lord and I am greatly blessed.","name":"IMG_0576.txt","index":118},{"verse":"Ecclesiastes 9:11 ESV","verseRepeat":"Again I saw that under the sun the race is not tothe swift, nor the battle to the strong, nor bread tothe wise, nor riches to the intelligent, nor favor tothose with knowledge, but time and chancehappen to them all.","blurb":"0: there is a great degree of chance in the outcomes of life. Outcomes are not always indicative of the individual who endures these things. A: to some extent because so much will be determined by seemingly just chance, I should be content everyday, and turn to God as my ultimate prize. Everything else in the world is uncertain but God is certain. P: Lord, though there is not much I can know in this earth I know you love me and you are good. I ask I'd always hold on to this and not lose sight of it and that it would encourage me as I struggle through life. You are good lord. Thank you for this day.","name":"IMG_0580.txt","index":119},{"verse":"Ecclesiastes 10:4 ESV","verseRepeat":"If the anger of the ruler rises against you, do notleave your place, for calmness will lay greatoffenses to rest.","blurb":"OAP: Lord I ask when my emotions are stirred within me that my first instinct would be to stay calm and keep it to myself. Help me not give way to the spur of the moment, or believe that I have to say something. Thank you Lord for your many blessings and the wisdom in your word. I ask you'd help me remember it.","name":"IMG_0581.txt","index":120},{"verse":"Ecclesiastes 10:10 ESV","verseRepeat":"If the iron is blunt, and one does not sharpen theedge, he must use more strength, but wisdomhelps one to succeed.","blurb":"OAP: Lord I ask as I begin to dig into a new job that you'd give me wisdom to succeed. Help me not act overly eagerly but be calm and yet move forward for the good of my employer. Help me navigate working with new folks that the relationship would be blessed and would be iron sharpening iron. Help me be empowered to help more people get the care they need and help me be a light of you, first and foremost, in the work place. Thank you for this day you have made and the grace and mercy you show me daily. Your will be done lord.","name":"IMG_0582.txt","index":121},{"verse":"Ecclesiastes 12:13 ESV","verseRepeat":"The end of the matter; all has been heard. FearGod and keep his commandments, for this is thewhole duty of man.","blurb":"OAP: God help me keep focus on you, and being obedient to your commands. Though uncertainties abound - you are my rock. You are the one I serve and you are great. Thank you for this day you've made and Libby being able to eat. I am a blessed man even if I don't feel it or often forget it. Please bless my work and guide me in wisdom and help me not be quick to anger.","name":"IMG_0585.txt","index":122},{"verse":"Song of Solomon 1:15 ESV","verseRepeat":"Behold, you are beautiful, my love; behold, you arebeautiful; your eyes are doves.","blurb":"OAP: Lord I thank you for these simpler pleasures you have blessed me with during my time here on earth with my beautiful wife who has been an incredible blessing to me. You have blessed me Lord again and again more than I can comprehend. Daily Lord your blessings are new and your grace abounds as I often falter. I ask for your blessing, that you protect me from myself, from pride and ego. Help me be humble as your son was humble and to trust you for my family's provision as you always have. Thank you for this day you have made Lord and the many great things you have blessed me with.","name":"IMG_0588.txt","index":123},{"verse":"Isaiah 1:31 ESV","verseRepeat":"And the strong shall become tinder, and his work aspark, and both of them shall burn together, withnone to quench them.","blurb":"0: If God is not behind us then all is lost and a vain chasing in the wind. No human strength or creation can last outside of God. A: Always turn to God and so not attempt any significant endeavor unless it is your best discernment that it is in obedience and the will of God. P: God help align my heart and all my efforts towards you for your glory and so that I can be as I was design to be. Help me be an effective member of your kingdom as I try to live under your lordship. I ask you forgive me my many sins and that you'd help me be more like your son. Thank you for this day you have made","name":"IMG_0174.txt","index":124},{"verse":"Isaiah 2:9 ESV","verseRepeat":"So man is humbled, and each one is brought low—do not forgive them!","blurb":"0: when we serve idols of our own making rather than exalting ourselves we are falling far beneath our potential. We make our selves slaves of things lesser to us rather than turning to the God of all creation and serving him - a good and loving king. A: serve only God and never the work of mans hands. For we were born for much greater things than this. Our king that we serve is the Lord of all. No less. P: God help me recognize and reject any idols that cross my path or have snuck into my life. You are my king and God. Help me serve you well while here and to advance your kingdom. Give me strength to be obedient and faith that I not falter. Thank you for this day you ha e made and your many blessings","name":"IMG_0176.txt","index":125},{"verse":"Isaiah 5:4 ESV","verseRepeat":"What more was there to do for my vineyard, that Ihave not done in it? When I looked for it to yieldgrapes, why did it yield wild grapes?","blurb":"0: though God extends many opportunities to do right - we in our own choosing often go against what he has commanded. We grow wild grapes with our deeds though through Christ He planted good seed. A: Praise God for what he has done for you and do not be foolish and go against him. P: God I ask you'd help me do this. I ask your forgiveness for when I have yielded wild grapes. Help me do better and be more like your son. Thank you for this day.","name":"IMG_0182.txt","index":126},{"verse":"Jeremiah 31:33 ESV","verseRepeat":"For this is the covenant that I will make with thehouse of Israel after those days, declares the Lord:I will put my law within them, and I will write it ontheir hearts. And I will be their God, and they shallbe my people.","blurb":"OAP: God thank you for showing such unmerited grace that I may know you and have your word and be put on a path to be more like you and your image bearer on earth. Thank you for this mercy and love that you have to me though I am small and you infinite. God help this act of grace sink deeper into my mind and heart and how I speak. Help me spread your word to others and point them to you Lord. You are great and greatly to be praised Lord. Thank you for this day you have made and blessing us with a church.","name":"IMG_0272.txt","index":127},{"verse":"Matthew 1:20 ESV","verseRepeat":"But as he considered these things, behold, anangel of the Lord appeared to him in a dream,saying, \"Joseph, son of David, do not fear to takeMary as your wife, for that which is conceived inher is from the Holy Spirit.","blurb":"0: Joseph was doing the right and wise thing given the knowledge that he possessed of the situation, but God protected him by sending an angel that steered him onto the right path. A: If after praying and careful consideration of the wise path, we should make a choice and trust God to steer us away from destruction if we are seeking him eagerly. P: God I ask you'd give me good judgement and wisdom to help me make good decisions. Help me not be frozen into indecision. I also ask you'd steer and protect me from making mistakes that do not keep with your will. Bless my steps and keep me where you would have me lord. Thank you for this day and what it means.","name":"IMG_0193.txt","index":128},{"verse":"Matthew 2:13 ESV","verseRepeat":"Now when they had departed, behold, an angel ofthe Lord appeared to Joseph in a dream and said,\"Rise, take the child and his mother, and flee toEgypt, and remain there until I tell you, for Herod isabout to search for the child, to destroy him.\"","blurb":"0: when God begins a new work there will be opposition. As we approach where it is God wants us to go or do what it is he has called us to do, we will draw the attention of the enemy. A: know that as you begin to do right certain things will get much harder for you and try to be prepared for this. P: Help me do your will and to grow in faith and strength as the trials also rise. Thank you for this day and time with family Lord.","name":"IMG_0196.txt","index":129},{"verse":"Matthew 3:9 ESV","verseRepeat":"And do not presume to say to yourselves, 'Wehave Abraham as our father,' for I tell you, God isable from these stones to raise up children forAbraham.","blurb":"0: God did raise \"Children of Abraham\" through the gentiles. He can use anyone or anything and he could indeed even make men from stone if he desired. A: I should know that serving the Lord is a blessing, and a great privilege, and that God does not need me but I need him. Though he loves me greatly, I am the one who depends on him, not the other way around. P: God though this fact is obvious I ask it not subtly get flipped around in my heart or actions but that I would always know even in my struggles that to struggle for your kingdom is ultimately a great privilege. Thank you for this day and time with family","name":"IMG_0198.txt","index":130},{"verse":"Matthew 4:10 ESV","verseRepeat":"Then Jesus said to him, \"Be gone, Satan! For it iswritten, \"'You shall worship the Lord your God andhim only shall you serve!\"","blurb":"OAP: Lord, I ask you'd help me live this out. Convict me where I have failed to do this. You are the only one I serve and should ever serve. Help focus my eyes on you and fostering your kingdom on earth for the salvation of others and your glory. Help me find my place in the body of Christ and to serve you well Lord. You are good, and everything I have is from you lord. Thank you for this day you have made and how richly you have blessed me. Help me realize in my heart that if I have you I already have all I need, and nothing else can compare.","name":"IMG_0064.txt","index":131},{"verse":"Matthew 5:16 ESV","verseRepeat":"In the same way, let your light shine before others,so that they may see your good works and giveglory to your Father who is in heaven.","blurb":"OAP: God I ask you'd help me do this well, that I'd do works for your glory in a way that can uplift others and turn their praises to you. My life is yours Lord and I ask you shape me into something that can aid others and please you. Thank you for this day you have made and for your abounding blessings you have given to me and Libby.","name":"IMG_0034.txt","index":132},{"verse":"Matthew 5:20 ESV","verseRepeat":"For I tell you, unless your righteousness exceedsthat of the scribes and Pharisees, you will neverenter the kingdom of heaven.","blurb":"0: though Pharisees were seen as the most devoted Jews of their day that righteousness was not enough on its own to enter the kingdom of heaven. A spiritual transformation from the grace of God through the death of his Son was needed. A: Praise God often for the salvation you have been given by grace through the death of Christ. And I should never allow myself to believe this salvation can be earned. It is a gift. P: God thank you for this gift of salvation You have blessed me with. You are good Lord. Thank you for this day you have made and this reminder.","name":"IMG_0065.txt","index":133},{"verse":"Matthew 5:46 ESV","verseRepeat":"For if you love those who love you, what reward doyou have? Do not even the tax collectors do thesame?","blurb":"OAP: God help me love those who do not love me back. Help me be selfless in my affections towards others so that I be more like your son. You loved me though I did not deserve it. I ask I'd be able to extend the same care to others, to lift them up when others will not. You are my prize Lord, and I ask you'd steer my heart and life to live in a way that reflects this. Thank you for this day you have made and your word.","name":"IMG_0067.txt","index":134},{"verse":"Matthew 6:9 ESV","verseRepeat":"Pray then like this: \"Our Father in heaven, hallowedbe your name.","blurb":"OAP: God, I ask you'd help me better see in my heart and that I would walk through life with the awareness in mind that because of what your son has done and I am also your son, an inheritor of your glory and a recipient of your love as a parent loves their child. Help this grow roots in my heart and supply a firm foundation for me when the world around me crumbles. You are great Lord and greatly to be praised. This present age is a mere shadow of what will come. Thank you God and glory and honor to you, my creator and savior. Thank you for this day.","name":"IMG_0072.txt","index":135},{"verse":"Matthew 6:9 ESV","verseRepeat":"Pray then like this: \"Our Father in heaven, hallowedbe your name.","blurb":"OA: Christ taught us that we can come to God as father to us. This intimate relationship is something to be meditated on and to cause us to be joyful and hopeful for the God of all creation holds an intimate place in our lives. P: God, Father, thank you for this day and your continued provision. You are my reason for hope and you are my source of true joy. Thank you for all these things and for salvation and providing for my family. You are my father, king, and God. In Jesus name I pray, amen.","name":"IMG_0455.txt","index":136},{"verse":"Matthew 6:10 ESV","verseRepeat":"Your kingdom come, your will be done, on earth asit is in heaven.","blurb":"OA: We as Christians who follow Christ as our king are to attempt to usher in his kingdom here on earth as much as we can by being his hands and feet. To give to those in need. Serve others with our abilities, put the needs of others above our own and glorify him above all. P: God I ask you'd forgive me for when I have fallen short of this thing. I often fall short of your glory and what you have called me to. I ask you'd focus my mind, clear my emotions, and help me be your hands and feet on earth to lift up a cure opt world. Help me be a light to those in darkness and for your light to inhabit me more. Thank you for this day you have made and your provision over me and Libby. I ask for health over the child developing within her.","name":"IMG_0458.txt","index":137},{"verse":"Matthew 6:11 ESV","verseRepeat":"Give us this day our daily bread,","blurb":"0: God provides our provision every day. Each day as we live and breath, he gives us life. A: I should not ask for more than I need in the present. I should lean on God daily, like the Jews in the desert where daily manna sustained. God will pride every day it's need. P: Lord, I ask you'd forgive my frequent lack of faith and I thank you for for your daily provision that sustains me. I will trust in you lord for your word is true and you never fail. Thank you for this day you have made and your provision today. In Jesus name I pray, amen.","name":"IMG_0451.txt","index":138},{"verse":"Matthew 6:11 ESV","verseRepeat":"Give us this day our daily bread,","blurb":"OAP: Lord you are my daily provision. You are my source and supply. With you my cup overflows. Without you I have nothing. I ask you'd continue to provide for me and Libby tomorrow. That you'd continue to help the baby growing in Libby to be healthy and happy. Help us be parent that raise a child that glorifies and delights you. The child is yours lord and I ask we raise it as such. Thank you for this day you have made, and I ask you'd be with our nation during this time that is very scary for me. I ask you'd clear the minds of our leaders and banish fear from our country and the world. I ask for healing in the world. And in your sons name I pray. Amen.","name":"IMG_0464.txt","index":139},{"verse":"Matthew 6:12 ESV","verseRepeat":"and forgive us our debts, as we also have forgivenour debtors.","blurb":"OA: Similar to how God has forgiven us we are to reflect his nature and forgive others who mean us harm. God gave to us forgiveness though we had nothing to give in return. So too should our forgiveness be to others. P: God o ask you'd bring to mind those I have failed to forgive, and I ask you'd help me be like you and extend grace where my enemies may wish me harm. Thank you for this day you have made and your many blessings","name":"IMG_0472.txt","index":140},{"verse":"Matthew 6:13 ESV","verseRepeat":"And lead us not into temptation, but deliver usfrom evil.","blurb":"OAP: Lord I ask that you'd steer me away from temptations that would seek to destroy me. Help me see when cracks are forming in my resolve against sin. I ask you'd protect me from the slippery slope that destroys so many and has fooled me in the past. And I thank you for your saving grace through your son's triumph. I have been saved by you lord. You are great and greatly to be praised. And in the end I will conquer by your grace the trials of this life. Glory to you and thank you for this day.","name":"IMG_0473.txt","index":141},{"verse":"Matthew 6:14-15 ESV","verseRepeat":"For if you forgive others their trespasses, yourheavenly Father will also forgive you, but if you donot forgive others their trespasses, neither willyour Father forgive your trespasses.","blurb":"OAP: God I ask you'd give me a forgiving heart that can truly let go of offenses rather than bury them and have them fester. I ask you'd help me learn to really forgive whether affections are totally one way or not. Help me focus on you and your sons love for me and loving others rather than personal reputation or offenses. Thank you for this day you have made and the innumerable ways you have blessed me.","name":"IMG_0078.txt","index":142},{"verse":"Matthew 6:25 ESV","verseRepeat":"\"Therefore I tell you, do not be anxious about yourlife, what you will eat or what you will drink, norabout your body, what you will put on. Is not lifemore than food, and the body more than clothing?","blurb":"OAP: God I ask you'd make it more clear to my mind and heart that my life is not the sum of the material possessions that I do or do not have - nor any worldly thing. You are my portion and prize. You are my master king and savior. I ask my heart would be of one accord with your heart and that my life would glorify you. Your will be done father. I ask you'd guide me to truth and wisdom that I may live well and lift up others to be closer to you. Thank you for this day you have made.","name":"IMG_0263.txt","index":143},{"verse":"Matthew 6:26 ESV","verseRepeat":"Look at the birds of the air: they neither sow norreap nor gather into barns, and yet your heavenlyFather feeds them. Are you not of more value thanthey?","blurb":"OAP: God I ask you'd keep this passage in mind when I consider things like retirement and giving. I ask your calm peace would wash over my anxieties about how retirement will pan out in the future. You are great and have supplied all my needs Lord. Me and my family. At times I am your hand of provision to my loved ones and others but you are ultimately the provider, not me. Glory to you great provider and savior. Thank you for this day you have gifted, and I ask tomorrow would be spent well in your eyes and build your kingdom.","name":"IMG_0079.txt","index":144},{"verse":"Matthew 6:27 ESV","verseRepeat":"And which of you by being anxious can add asingle hour to his span of life?","blurb":"OAP: Lord I am so small and my reach so short. Without you and your kingdom I am nothing. From dust man was made and without you dust is all we become. The work of my hands shall not endure and my name will fade away from man's memory. But your name will live on. The work of your hands is established and good. You speak life into the universe and make eternal beings because it is your delight to do so. You are great and mysterious and powerful. You are my king and you are why I live. Help me focus more on you and being your will embodied on earth. Thank you for this day you have made. It is yours and I ask my use of it would glorify you.","name":"IMG_0264.txt","index":145},{"verse":"Matthew 6:31 ESV","verseRepeat":"Therefore do not be anxious, saying, 'What shallwe eat?' or 'What shall we drink?' or 'What shall wewear?'","blurb":"OAP: God I ask you'd help this sink in, that I not turn to materialistic concerns but instead try to be your representative and glorify you by reflecting to others that you are glorious by living a life a life that is a testament that you are all there is. You are the prize Lord. Thank you for this day you have made and my innumerable blessings. You are my savior and provider.","name":"IMG_0081.txt","index":146},{"verse":"Matthew 6:33 ESV","verseRepeat":"But seek first the kingdom of God and hisrighteousness, and all these things will be addedto you.","blurb":"OAP: Lord, you are my provider. All I have is from you. It is a gift you have given. My talents too, are a blessing from your hand. Thank you. Because you have taken care of all I need I ask you'd focus my mind and eyes to your kingdom and what I can do to glorify you during my time here. Thank you for this day you have made and your many blessings. You are good, my creator, savior and provider.","name":"IMG_0069.txt","index":147},{"verse":"Matthew 6:33 ESV","verseRepeat":"But seek first the kingdom of God and hisrighteousness, and all these things will be addedto you.","blurb":"OAP: God as I have asked before I ask again, that you would teach me more what it means to seek your kingdom and righteousness. I ask you'd teach me these things. Thank you for the example your son sets for me in your word. Help me serve and love others as exemplified by what he did on Calvary. To lay down my life for others. Thank you for this day you have made and for providing for me and Libby.","name":"IMG_0475.txt","index":148},{"verse":"Matthew 6:34 ESV","verseRepeat":"\"Therefore do not be anxious about tomorrow, fortomorrow will be anxious for itself. Sufficient forthe day is its own trouble.","blurb":"OAP: God I ask you'd remove my anxiety and my fixation with work and my future. I ask your forgiveness for me allowing it to flourish. Help my mind be clear and to be focused on your truth and for your glory. Thank you for providing and help me be wise with my work and to stay far away from foolishness.","name":"IMG_0070.txt","index":149},{"verse":"Matthew 7:3 ESV","verseRepeat":"Why do you see the speck that is in your brother'seye, but do not notice the log that is in your owneye?","blurb":"OAP: God I ask I not be naive about myself or prideful. All I have is from you. Without you I am nothing and with you I have everything. This is true for all men and I ask I not forget this. Help me shine your light to others and glorify you. Help me be slow to anger and quick to love and forgive. Help me speak truth but in gentleness. Thank you for this day Lord, and all your countless blessings you give everyday.","name":"IMG_0085.txt","index":150},{"verse":"Matthew 7:12 ESV","verseRepeat":"\"So whatever you wish that others would do toyou, do also to them, for this is the Law and theProphets.","blurb":"OA: As children of God, we should treat others with the same care and respect that we treat ourselves. And in this verse Christ summarizes for us that the law and words of the prophets boils down to something like this in most ways. Live in a way that reflects the reality that other souls are as important as our own. P: Lord I ask you'd help me do just that and that you'd lay this on my heart. You are great and worthy of praise and I ask I'd praise you through loving and caring for others as your son did. Help correct my view so that I see others the way you do Lord.","name":"IMG_0071.txt","index":151},{"verse":"Matthew 8:9 ESV","verseRepeat":"For I too am a man under authority, with soldiersunder me. And I say to one, 'Go,' and he goes, andto another, 'Come,' and he comes, and to myservant, 'Do th's,' and he does it.\"","blurb":"OAP: God though something seems impossible to me, I ask you'd help me remember that nothing is impossible for you. You restored Joseph from a prisoner to second to the pharaoh in the matter of days, and turned the tide of history with one lifetime (your son) Nothing is impossible for you. You truly are a miracle worker. Help me never forget this and may it give me courage when times are hard. Thank you for this day you have made Lord and for your countless blessings.","name":"IMG_0092.txt","index":152},{"verse":"Matthew 8:26 ESV","verseRepeat":"And he said to them, \"Why are you afraid, 0 you oflittle faith?\" Then he rose and rebuked the windsand the sea, and there was a great calm.","blurb":"OAP: God I ask I'd have the faith of a mustard seed to have the truth deep in my heart. Strengthen my faith lord. Help me internalize that you control the wind and seas and all the things that foolishly give me anxiety. Thank you for this day you have made and your many blessings. I ask you'd be with me and Libby as we try a new church tomorrow and that you'd bless our old church and encourage them and continue to have your love shine through them. I ask for wisdom and guidance for the pastor there and your hand over the service me and Libby will go to and thank you for this day.0 q at","name":"IMG_0087.txt","index":153},{"verse":"Matthew 9:17 ESV","verseRepeat":"Neither is new wine put into old wineskins. If it is,the skins burst and the wine is spilled and theskins are destroyed. But new wine is put into freshwineskins, and so both are preserved.\"","blurb":"0: When we are saved we become something fundamentally different. God does not pure new wine in old wine skins but makes us wholly new. We are no longer slave to the things that previously enslaved us, but we are free in him and more than conquerors. A: I should reflect on this more often, that through Christ I have been made into something wholly new and entirely alien to this world. P: God I ask you'd help this be firmly in my heart and I not accept a status quo for myself based on the world or my old enslaved sinful self, but that I would take up this new life and be a member of your kingdom for your glory Lord. Thank you for this lesson and this day you have made.","name":"IMG_0093.txt","index":154},{"verse":"Matthew 9:37-38 ESV","verseRepeat":"Then he said to his disciples, \"The harvest isplentiful, but the laborers are few; therefore prayearnestly to the Lord of the harvest to send outlaborers into his harvest.\"","blurb":"OA: there are many out there to be saved and helped. The harvest is plentiful, and we should pray that the harvest is gathered not necessarily that we be the ones to do it. We should care about the salvation of others. P: God I ask you'd lay others on my heart, and I pray your kingdom would come, that your name would be glorified through more turning to your son, and I ask your kingdom would rule more in my own heart. Make me more of your kingdom and less if this world, for your glory Lord. Thank you for this day you have made and how you have blessed me so richly in mercy, grace, family and friends.","name":"IMG_0091.txt","index":155},{"verse":"Matthew 11:28 ESV","verseRepeat":"Come to me, all who labor and are heavy laden,and I will give you rest.","blurb":"0: we can come to God with our burdens, and lay them at his feet. Our God is good, and he sees us where we are at, and loves us. A: lay your concerns before the lord, and let him win the victory and guide your heart. P: God I ask that you'd provide a path with my career, and that you'd guide Libby's choice of specialty and our choice to have children. Help us better understand why evil is allowed to be, and to be so great. Help us be your sons hands and feet in light of evil and to glorify you.","name":"IMG_0094.txt","index":156},{"verse":"Matthew 12:34 ESV","verseRepeat":"You brood of vipers! How can you speak good,when you are evil? For out of the abundance of theheart the mouth speaks.","blurb":"OAP:God I ask you'd make my heart good so that I can speak well and do good. I ask your love would overflow out of me to others. Help me love others more and I ask your forgiveness when I have fallen short of this. Thank you for this day you have made and I ask you comfort my sister during this time. Your will be done.","name":"IMG_0097.txt","index":157},{"verse":"Matthew 12:50 ESV","verseRepeat":"For whoever does the will of my Father in heaven ismy brother and sister and mother.\"","blurb":"0: if you are talking to another believer you are talking to an eternal brother or sister as close as any biological sibling though we do not have eyes to see it. The body of Christ is the family of every Christian in a truer sense than any biological family. A: I should reflect on the intensity of my affections for my biological family and remind myself that this is my connection to the whole body of Christ, and I have many brothers and sisters in great need. P: God I ask I could be your hand of blessing to others, that I could have eyes to see truly all my brothers and sisters. And help me love them all well and in a way that pleases you. I ask for your guidance and that you steer me to be more like your son. In Jesus name I pray.","name":"IMG_0098.txt","index":158},{"verse":"Matthew 13:21 ESV","verseRepeat":"yet he has no root in himself, but endures for awhile, and when tribulation or persecution ariseson account of the word, immediately he falls away.","blurb":"OAP: Hod I ask your word would take root in me. Help me be strong when facing life's tribulations, to not just talk a good game but live it. Help me stand firm with my faith is threatened and give me right responses to these things. Thank you for this day you have made Lord. Thank      Help I I I I I I I I I 1 1 1 1 1 1 1 1 1 ■                           ■ e","name":"IMG_0100.txt","index":159},{"verse":"Matthew 14:30-31 ESV","verseRepeat":"But when he saw the wind, he was afraid, andbeginning to sink he cried out, \"Lord, save me.\"Jesus immediately reached out his hand and tookhold of him, saying to him, \"0 you of little faith,why did you doubt?\"","blurb":"OA: We like Peter are also prone to lapses of faith even after Christ has done a great thing for us, and all us Christians have our salvation Christ has worked in us - an unknowable great miracle. But often the struggles of like will cause us to doubt anyway our memories being very short. We should try to remember and repeat often the good things God has done for us and praise him and let our faiths be sure. P: God I ask you solidify in my mind and heart the great things you have done and have said you will do, that my faith would be strong and life's hardships would bring me closer to you. Thank you for this day you have made and for your word.","name":"IMG_0101.txt","index":160},{"verse":"Matthew 15:3 ESV","verseRepeat":"He answered them, \"And why do you break thecommandment of God for the sake of yourtradition?","blurb":"0: Man can often take their traditions to be commandments though they are only conventions or preferences among equal options. A: What is from God hold fast to, but never let your tradition work against you when considering Gods clear will in a matter. I should keep the laws that we are called to keep and never compromise on those or allow them to be passed. P: God I ask you'd help me see where I make this mistake in my own life. Help me do what I can to minimize this in my own life. Your word is law and your will in many ways is known. I ask you'd guide me down the obedient path. Your will be done Father, not my will.","name":"IMG_0102.txt","index":161},{"verse":"Matthew 15:18-20 ESV","verseRepeat":"But what comes out of the mouth proceeds fromthe heart, and this defiles a person. For out of theheart come evil thoughts, murder, adultery, sexualimmorality, theft, false witness, slander. These arewhat defile a person. But to eat with unwashedhands does not defile anyone.\"","blurb":"OAP: God, I ask you'd give me a pure heart, that you'd make in me this. I know one day all hearts after you will be made pure, but I ask that during this life - that Id be free of sin and cling tightly to you and your word. You are everything I need Lord. Help me be perfect as you are perfect, help me represent a follower of your son well that you'd be glorified and I would convey you as your are. Thank you for this day you have made and how you've blessed me.","name":"IMG_0114.txt","index":162},{"verse":"Matthew 16:23 ESV","verseRepeat":"But he turned and said to Peter, \"Get behind me,Satan! You are a hindrance to me. For you are notsetting your mind on the things of God, but on thethings of man.\"","blurb":"OAP: Lord I ask you'd always have me be someone who sets others minds to you, that I would point them towards you and your kingdom and not refocus their minds in the things of earth which already fight for their minds. Thank you for this day you have made and this incredible time with family. I am very blessed Lord.","name":"IMG_0115.txt","index":163},{"verse":"Matthew 16:24 ESV","verseRepeat":"Then Jesus told his disciples, \"If anyone wouldcome after me, let him deny himself and take uphis cross and follow me.","blurb":"OAP: God I ask you'd empower me to carry my cross and help me be a source of encouragement to those struggling to carry their own. Help me keep my eyes on the prize as I walk through life. I thank you for this great day with family and how you have blessed me so greatly. You are good God, and good to us. Thank you.","name":"IMG_0118.txt","index":164},{"verse":"Matthew 16:25 ESV","verseRepeat":"For whoever would save his life will lose it, butwhoever loses his life for my sake will find it.","blurb":"OAP: God I ask you'd guide me on the path to losing my life for your sake and really learn what this means by living it out. If I have you, which I do through your son, I have everything. And if all I had were the things of the world I would have nothing but dust. I thank you for this great day you've made and time with family. I am incredibly blessed Lord.","name":"IMG_0117.txt","index":165},{"verse":"Matthew 17:27 ESV","verseRepeat":"However, not to give offense to them, go to the seaand cast a hook and take the first fish that comesup, and when you open its mouth you will find ashekel. Take that and give it to them for me and foryourself.\"","blurb":"OA: there are times where though someone is pushing hard for something that is not necessarily correct, because it would cause them to stumble to do otherwise and because it is no sin to do this thing, sometimes it is right to just cater to them, as a show of love. P: God help me know the appropriate times for not giving offense and when to take a stand. I ask for wisdom in this realm of life and thank you for this word.","name":"IMG_0119.txt","index":166},{"verse":"Matthew 18:20 ESV","verseRepeat":"For where two or three are gathered in my name,there am I among them.\"","blurb":"0: when we are gathered in a group for the sake of Christ and we seek him, he is among us. Christ is with us when we unite under his name, and in this we can have great confidence when facing adversity. A: I should muster up my courage knowing that Christ is with me when I am united with others for Christ's sake. With Christ with me, I can stand strong in-spite of any adversity and I should seek community in the body of Christ when times are hard P: God, I ask it would stay on my heart that your sin is with us when we have gathered in his name. Help my faith and courage be strengthened by this and thank you for this day you have made.","name":"IMG_0125.txt","index":167},{"verse":"Matthew 18:35 ESV","verseRepeat":"So also my heavenly Father will do to every one ofyou, if you do not forgive your brother from yourheart.\"","blurb":"OA: God has forgiven all of us a great amount. Not a one of us stands before God blameless. But through Christ's sacrifice and the Father's forgiveness, we have had our debt cleared, and have it cleared daily in our behalf by our high priest whose reign continues. P: God I ask you'd convict me for anyone I have failed to forgive. Help them come to mind that I may forgive them as well. For you have forgiven me of many things. Help me forgive others then. Thank you for this day you have made and how you have blessed me so.","name":"IMG_0124.txt","index":168},{"verse":"Matthew 21:15-16 ESV","verseRepeat":"But when the chief priests and the scribes saw thewonderful things that he did, and the childrencrying out in the temple, \"Hosanna to the Son ofDavid!\" they were indignant, and they said to him,\"Do you hear what these are saying?\" And Jesussaid to them, \"Yes; have you never read, \"'Out ofthe mouth of infants and nursing babies you haveprepared praise'?\"","blurb":"OA: Christ claims to be Lord of the world. He does not leave us wiggle room to think him merely a good teacher unless we choose not to hear what he says. He is King and will be seen as such, or he is a mad man. Because we his followers know him to be king we should encourage those who may be lukewarm to take harder look at who Christ said he was. P: God glory to you my king. Thank you for your word and the blessing it is to me. I ask you'd help me spark people out of indifference toward you and to think and reason more. Thank you for this day you have made.","name":"IMG_0543.txt","index":169},{"verse":"Matthew 22:37-40 ESV","verseRepeat":"And he said to him, \"You shall love the Lord yourGod with all your heart and with all your soul andwith all your mind. This is the great and firstcommandment. And a second is like it: You shalllove your neighbor as yourself. On these twocommandments depend all the Law and theProphets.\"","blurb":"OAP: Lord help me always keep these two laws in mind for from them stem everything else in the law. Help me learn what it is to love you with everything I have, as well as to love all others as I love myself where their pain is like my own pain and their joy is my joy. I ask you cast out of me all idolatry and selfishness and focus my gaze and you and on others because of you. Thank you for this day you have made lord and for you many blessings.","name":"IMG_0546.txt","index":170},{"verse":"Matthew 28:19 ESV","verseRepeat":"Go therefore and make disciples of all nations,baptizing them in the name of the Father and ofthe Son and of the Holy Spirit,","blurb":"OA: The mandate God has given us is to spread his word to all peoples, doing the things he did and taught us to do through his words and exemplary life. And we should do these things. P: God I ask you'd equip me to spread your good news to others, that I would be empowered to speak truth well such that others could hear and turn. I also ask you'd bless Libby and her efforts to do similarly in the hospital setting. Thank you Lord for blessing and securing us. I ask for your continued protection and help. You are greatly and worthy of praise!","name":"IMG_0224.txt","index":171},{"verse":"Mark 14:38 ESV","verseRepeat":"Watch and pray that you may not enter intotemptation. The spirit indeed is willing, but theflesh is weak.\"","blurb":"OAP: God I ask you'd strengthen my spirit and help me not enter into temptation but instead to be holy as you are holy, free from shackles of sin. Help me do what it is you would have me do. Help me not to be legalistic while I do the wise thing of avoiding temptation. I thank you for this day you have made and for the teachings you have bestowed. I ask you'd bless my coming work week and help me be wise in my actions. Glory to you Lord","name":"IMG_0063.txt","index":172},{"verse":"Luke 1:2-3 ESV","verseRepeat":"just as those who from the beginning wereeyewitnesses and ministers of the word havedelivered them to us, it seemed good to mealso, having followed all things closely forsome time past, to write an orderly accountfor you, most excellent Theophilus,","blurb":"OAP: Lord I ask you'd help me better understand your word as historical fact as well as guide and to better understand what that means. You have blessed me tremendously, and have forgiven me of countless offenses. You have given me a good wife and a good job and have made my path straight. Thank you Lord. I am greatly blessed among men. Help me better understand that the historical fact of what your son did and is doing saved my soul. You are good Lord.","name":"IMG_3240.txt","index":173},{"verse":"Luke 1:26-27 ESV","verseRepeat":"In the sixth month the angel Gabriel was sentfrom God to a city of Galilee named Nazareth,to a virgin betrothed to a man whose namewas Joseph, of the house of David. And thevirgin's name was Mary.","blurb":"0: Mary was of low station in life as a Jewish Galilean, a woman, unmarried, and young. And God chose her to be the one to bear God's son. A: I should take heart in knowing that God picks us not for merit on our own or our ability, by grace and mercy he lifts us up, and causes us, who were not great, to do great things. P: God I ask you'd give me bravery to do what you have called me to do, and also I ask you'd give me eyes to see others as valuable as you see them. Thank you for this day and this lesson.","name":"IMG_3242.txt","index":174},{"verse":"Luke 6:38 ESV","verseRepeat":"give, and it will be given to you. Goodmeasure, pressed down, shaken together,running over, will be put into your lap. For withthe measure you use it will be measured backto you.\"","blurb":"OAP: help me have a generous heart lord with my time, resources, and abilities. I ask I'd be loving to others, patient with them as you are patient with me, help me love others as your son loved and loves others. Give me your eyes to see others, and to speak beneficial words to them. Help me love a life that reflects your son's impact on me, that I may be known to be yours, and may my life glorify you.","name":"IMG_3241.txt","index":175},{"verse":"Luke 7:32 ESV","verseRepeat":"They are like children sitting in themarketplace and calling to one another, \"'Weplayed the flute for you, and you did notdance; we sang a dirge, and you did notweep'","blurb":"OAP: God I ask I would not live a life that reflects this double speak. Instead I ask I'd be of one mind and for this to be in accord with your mind. Also I ask for wisdom in navigating a world filled with individuals that desire to put you in a lose lose scenario, that wish to stay where they are, though it be contradictory. Help me show grace and love and speak truth in a way that would cut through this. Thank you for this day Lord.","name":"IMG_3244.txt","index":176},{"verse":"Luke 8:14 ESV","verseRepeat":"And as for what fell among the thorns, theyare those who hear, but as they go on theirway they are choked by the cares and richesand pleasures of life, and their fruit does notmature.","blurb":"OAP: God you have blessed me materially. I ask these blessings would not be a stumbling block but that I could take what you'd given and multiple and bless others. Help not have my spiritual fruit choked with cares and riches of life, but to always turn to you, and not be satisfied on the deepest level with these worldly things. Please help me avoid this very dangerous stumbling block","name":"IMG_3247.txt","index":177},{"verse":"Luke 8:54 ESV","verseRepeat":"But taking her by the hand he called, saying,\"Child, arise.\"","blurb":"0: Christ says something similar to us all. And like this girl, we were all dead and and Christ also called us to rise and be alive, dead to our old selves, born again in his image - his imprint on our heart. AP: Glory to you lord for this incredible saving grace. Your son makes us all knew and calls us all to a new life, conquering death itself in the end. Thank you for this reminder and this day. Help me never forget this incredible grace you have bestowed and how I am a new creature, and in your image. As well as all men and women.","name":"IMG_3248.txt","index":178},{"verse":"Luke 9:5 ESV","verseRepeat":"And wherever they do not receive you, whenyou leave that town shake off the dust fromyour feet as a testimony against them.\"","blurb":"OAP: help me know when it is an opportune time to share to good news with others. I ask you'd give me wisdom in this lord to know when I should shake the dust from my feet.","name":"IMG_3249.txt","index":179},{"verse":"Luke 9:6 ESV","verseRepeat":"And they departed and went through thevillages, preaching the gospel and healingeverywhere.","blurb":"OAP: God I ask that everywhere me and Libby go that we too could preach the gospel in our own way as is appropriate and heal in our own way. Help us be a light lord. Not for our own sake or the area but for your glory. I ask that all we do would be in praise and honor for you and that we not forget that all human life is sacred, and in your image. Not only our immediate neighbors but those we cannot see as well.","name":"IMG_3259.txt","index":180},{"verse":"Luke 9:25 ESV","verseRepeat":"For what does it profit a man if he gains thewhole world and loses or forfeits himself?","blurb":"OAP: God help me as I go about my work days, that I always keep you first and not waver from that. I ask what your son has done for me would stay in the forefront of my mind and that I glorify you lord. Thank you for this day.","name":"IMG_3265.txt","index":181},{"verse":"Luke 9:62 ESV","verseRepeat":"Jesus said to him, \"No one who puts his handto the plow and looks back is fit for thekingdom of God.\"","blurb":"OAP: God, this is a hard saying. Help me be committed to you entirely. I ask I'd love my neighbor and honor you. I ask for wisdom when I speak and wisdom for when to not speak. Help me live in a way that reflects your son. I ask you'd strengthen my faith and that you'd help me avoid the folly of fools. I ask you'd forgive me for not always heading this advice given by your word.","name":"IMG_3271.txt","index":182},{"verse":"Luke 10:37 ESV","verseRepeat":"He said, \"The one who showed him mercy.\" AndJesus said to him, \"You go, and do likewise.\"","blurb":"OA: God has called us to going above and beyond in love to those who would be our enemy and to those who lack the ability to return the favor. In this way we act as Christ does in giving ourselves for others as servants. P: Lord I ask you'd help me serve my fellow man - that I could be a blessing to my coworkers and do good by them. Help me find ways to glorify you there for whatever time you'd have me there. I believe you are with me lord and I ask you'd empower me to do good and stay faithful.","name":"IMG_0600.txt","index":183},{"verse":"Luke 10:41-42 ESV","verseRepeat":"But the Lord answered her, \"Martha, Martha, youare anxious and troubled about many things, butone thing is necessary. Mary has chosen the goodportion, which will not be taken away from her.\"","blurb":"OAP: Lord I ask you'd keep me focused on the one necessary thing, that your are my God and you love me. You are matchless God. Help me see past anxiety and day to day concerns and help me focus on eternal things. To hear your word and spend time in prayer and loving others. Help me serve others and be concerned with myself last. Thank you for this day Lord. I am a blessed man because I know my redeemer live.","name":"IMG_0605.txt","index":184},{"verse":"Luke 10:41-42 ESV","verseRepeat":"But the Lord answered her, \"Martha, Martha,you are anxious and troubled about manythings, but one thing is necessary. Mary haschosen the good portion, which will not betaken away from her.\"","blurb":"OAP: Lord I ask I not make Martha's mistake. And I ask you'd forgive me for the many times I know I have made this mistake. help me not behave in an urgent way forgetting what is most important, but always taking time to seek you out and your glory. Help me keep a right perspective on things. You are the big picture Lord and I ask you'd give me eyes to see that.","name":"IMG_3272.txt","index":185},{"verse":"Luke 11:4 ESV","verseRepeat":"and forgive us our sins, for we ourselvesforgive everyone who is indebted to us. Andlead us not into temptation.\"","blurb":"OAP: God I ask you bring it to my mind those that are indebted to me in my heart that I have not yet forgiven that I may do so. For you have forgiven me of many things, many more than I understand. I ask your spirit would make me as forgiving to others, that I extend and reflect the love you have shown me to others. Thank you for this day and your word.","name":"IMG_3273.txt","index":186},{"verse":"Luke 11:13 ESV","verseRepeat":"If you then, who are evil, know how to givegood gifts to your children, how much morewill the heavenly Father give the Holy Spirit tothose who ask him!\"","blurb":"OAP: God I ask you'd give me your spirit, that I be empowered to be more like you. Help me have strong faith, wisdom, and love for others to better represent you and to honor you for the great acts of mercy you have shown me. You are great Lord. Thank you for providing for Libby and for being with me as well. Help me be more like your son. I ask your spirit would empower me.","name":"IMG_3276.txt","index":187},{"verse":"Luke 11:29 ESV","verseRepeat":"When the crowds were increasing, he beganto say, \"This generation is an evil generation.It seeks for a sign, but no sign will be given toit except the sign of Jonah.","blurb":"OA: Christ is our sign from heaven given to us. The person of Christ is the one we are to look to, not necessarily miracles of a spectacular nature. The person of Christ is our evidence and foundation. P: God I ask you'd help this sink in and be an anchor for my faith as I go through life, and be my guide. Your son is the sign given to us, his life death and resurrection are our source of faith. Help that sink in and grown in my heart. Thank you for this day and I ask you'd given me wisdom Dra is (1)","name":"IMG_3278.txt","index":188},{"verse":"Luke 11:34 ESV","verseRepeat":"Your eye is the lamp of your body. When youreye is healthy, your whole body is full of light,but when it is bad, your body is full ofdarkness.","blurb":"OAP: God I ask that I'd always have my gaze towards you, that my body may be full of light. I ask you'd help me discern when I am looking at darkness, so that I can turn away and back to you. Thank you for this day you have made. Please give me wisdom in regards to our church to make a right decision. Glory to you Lord. I ask you'd place us where you want us.","name":"IMG_3284.txt","index":189},{"verse":"Luke 11:52 ESV","verseRepeat":"Woe to you lawyers! For you have taken awaythe key of knowledge. You did not enteryourselves, and you hindered those who wereentering.\"","blurb":"0: when we embrace and spread legalism, we miss the main point which is we are saved by the grace of God through his son. We also make this harder for others to see. Presuming we have found the truth we instead miss the mark and cause others to as well. A: never give in to legalism, but in all things look to Christ and what he has given to you and done for you. Point others to Christ. P: God, help me not fall into the very old trap of legalism, but have a genuine faith and fear of you, knowing in my heart that I am loved by you and saved by grace. Guide me to truth Lord.","name":"IMG_3283.txt","index":190},{"verse":"Luke 11:54 ESV","verseRepeat":"lying in wait for him, to catch him in something hemight say.","blurb":"OA: I should be shrewd in my dealings with others who may want to catch me in my words and see me fail. We should eat h what we say closely as well as who we say what too, knowing there are those that would wish us ill. P: God I ask you'd defend me from evil plots, from my fellow man as well as supernatural attacks. You are my strength and stronghold and in you I trust. I ask for your protection over me Libby and the baby within her. Thank you for this day lord and in Jesus name I pray.","name":"IMG_0606.txt","index":191},{"verse":"Luke 12:1 ESV","verseRepeat":"In the meantime, when so many thousands ofthe people had gathered together that theywere trampling one another, he began to sayto his disciples first, \"Beware of the leaven ofthe Pharisees, which is hypocrisy.","blurb":"0: the hypocrisy of other is contagious, like leaven in bread it spreads through the whole. A: be vigilant that you not succumb to this when you are around those that are displaying hypocrisy. It will drive you to complacency if you are always in the company and heading the council of those who are hypocrites. P: God help me heed this warning and carry it out so that I not stumble into complacency and hypocrisy. Thank you for this day Lord.","name":"IMG_3285.txt","index":192},{"verse":"Luke 12:3 ESV","verseRepeat":"Therefore whatever you have said in the darkshall be heard in the light, and what you havewhispered in private rooms shall beproclaimed on the housetops.","blurb":"0: everything we do is before our God, there is no idle word or thought that is not known by the creator of the universe. A: treat ever moment as counting. Though I should not give in to a legalistic mentality I should know there are no truest moments to myself. I am always in the company of my God and king. P: help me remember this lord, and I ask for your forgiveness for when I have forgotten this or lived contrary to it. Everything we do will be brought to the light. Help that become a reality in my head and heart.","name":"IMG_3293.txt","index":193},{"verse":"Luke 12:4-5 ESV","verseRepeat":"\"I tell you, my friends, do not fear those whokill the body, and after that have nothing morethat they can do. But I will warn you whom tofear: fear him who, after he has killed, hasauthority to cast into hell. Yes, I tell you, fearhim!","blurb":"0: We are eternal beings that will live in after this life. That means all the things we do here in this life will be a blip compared to the whole. A: I should live as though God is of infinite importance and myself as being a reflection of him, and that I will live on forever, and my actions have potential consequences for eternity. P: thank you lord for this reminder. Help it become a reality in my head and my heart.","name":"IMG_3296.txt","index":194},{"verse":"Luke 12:8 ESV","verseRepeat":"\"And I tell you, everyone who acknowledgesme before men, the Son of Man also willacknowledge before the angels of God,","blurb":"OAP: God I ask you'd make me a better person. Help me represent you better than I do and to glorify you. I ask you forgive me for my fast words today. I should think before I speak and know that I am your representative. Help me do better and be a blessing to others and thank you for this day.","name":"IMG_3294.txt","index":195},{"verse":"Luke 12:20-21 ESV","verseRepeat":"But God said to him, 'Fool! This night yoursoul is required of you, and the things youhave prepared, whose will they be?' So is theone who lays up treasure for himself and isnot rich toward God.\"","blurb":"OAP: help me always be rich towards you lord and not to store up treasure here where it will fade away. Help me always put you first and I ask for forgiveness for when I have failed to do this. Thank you for this day you have made and for how you have blessed me and Libby. I ask for some rest and that I serve others well tomorrow. Your will be fine not my will.","name":"IMG_3290.txt","index":196},{"verse":"Luke 12:22-23 ESV","verseRepeat":"And he said to his disciples, \"Therefore I tellyou, do not be anxious about your life, whatyou will eat, nor about your body, what youwill put on. For life is more than food, and thebody more than clothing.","blurb":"OAP: Lord help me never be anxious about anything but in fear of you to walk through life with no other fears. Help the smallness of things and the largeness you you take root in my heart and manifest in my actions. Thank you for this day and time with my wife. Help me be a blessing to others and glorify your name.","name":"IMG_3299.txt","index":197},{"verse":"Luke 12:29-31 ESV","verseRepeat":"And do not seek what you are to eat and whatyou are to drink, nor be worried. For all thenations of the world seek after these things,and your Father knows that you need them.Instead, seek his kingdom, and these thingswill be added to you.","blurb":"OAP: God, I ask you'd teach me what it means to seek your kingdom. Help me not be distracted by the world, but to look to you for my purpose and reason. I ask you'd forgive me for times where I have given into worries about the daily things of life, and worried about small things in the eternal scale of things. Help me see clearly and to love all the eternal souls I interact with on a daily basis.","name":"IMG_3303.txt","index":198},{"verse":"Luke 12:48 ESV","verseRepeat":"But the one who did not know, and did whatdeserved a beating, will receive a light beating.Everyone to whom much was given, of him muchwill be required, and from him to whom theyentrusted much, they will demand the more.","blurb":"OAP: Lord I pray I'd be responsible with the plethora of resources you have blessed me with. You have equipped me and Libby richly. I pray I never fall in love and service to wealth - but instead channel it into a tool for your kingdom. All I have is from you Lord. I ask your guidance to how to use it well and that you'd bring opportunities for service that I can lift others up. Thank you for this day you I have made and your word. I ask Libby could eat well tomorrow and your hand would be over her.","name":"IMG_0607.txt","index":199},{"verse":"Luke 13:2-3 ESV","verseRepeat":"And he answered them, \"Do you think that theseGalileans were worse sinners than all the otherGalileans, because they suffered in this way? No, Itell you; but unless you repent, you will all likewiseperish.","blurb":"OA: God has forgiven all his followers of many things for we all have countless sins. Every bad thing that befalls is is not indicative of some special judgement for the whole world is fallen and we all deserve condemnation - but through Christ we are forgiven. P: God I ask my heart never grow dull to your great mercies. Help me be a faithful servant in whatever way you see fit and thank you for this day you have made. Thank you for improved health for Libby and your constant provision.","name":"IMG_0555.txt","index":200},{"verse":"Luke 13:4-5 ESV","verseRepeat":"Or those eighteen on whom the tower inSiloam fell and killed them: do you think thatthey were worse offenders than all the otherswho lived in Jerusalem? No, I tell you; butunless you repent, you will all likewise perish.\"","blurb":"0: we often confuse someone's circumstance with their goodness. Jesus tells us here that this is not the case. When tragedy happens to a person often it is not at all an indication of goodness or badness. A: never assume based on where someone is in life at a precise moment that they are good or bad. We are all fallen in need of a savior. P: God I ask I judge rightly and not hastily, and that I not give in to overly simplistic karma ways of looking at things. Help me see things well and wisely.","name":"IMG_3304.txt","index":201},{"verse":"Luke 13:19 ESV","verseRepeat":"It is like a grain of mustard seed that a man tookand sowed in his garden, and it grew and becamea tree, and the birds of the air made nests in itsbranches.\"","blurb":"OA: The kingdom of God has humble beginnings where it starts with a bare seed but flourishes into a strong tree. In a similar way God can use small things to large impact, including me. I should take heart and know that God can always meet my need and then some and he knows no limits. P: God I ask you'd train me in how to be a good citizen of your kingdom and this earth. That I glorify and love you above all and then love others as I love myself. Remove all pride from me and I ask for forgiveness for my sins. I ask you'd lead me away from temptation and my development as your child would not be hindered. Thank you for this day and your countless blessings","name":"IMG_0557.txt","index":202},{"verse":"Luke 13:30 ESV","verseRepeat":"And behold, some are last who will be first,and some are first who will be last.\"","blurb":"OA: God's measure is not the same as the world's measure. Though someone may be lower than me here, they may be a giant in the kingdom of God. I should respect others and love them as I love and respect myself, and when speaking to someone below me in authority, I should be aware that in the kingdom of God roles may be reversed! P: God help me be a better lover of others. Give in my heart a reverence for all life, not only some. Help me see outside myself and to care for others the same way I so often care for myself.","name":"IMG_3308.txt","index":203},{"verse":"Luke 14:11 ESV","verseRepeat":"For everyone who exalts himself will be humbled,and he who humbles himself will be exalted.\"","blurb":"OAP: Lord help me always remember this lesson and be humble in my interactions with others. You are great lord and thank you for this day. Amen.","name":"IMG_0611.txt","index":204},{"verse":"Luke 14:11 ESV","verseRepeat":"For everyone who exalts himself will behumbled, and he who humbles himself will beexalted.\"","blurb":"OAP: God I pray I not follow the advice of so many of self promotion but instead I ask that I would be humble before my fellow man and you, for all I have is because of you lord. With out your grace and love I have nothing, and with you alone I have everything. I ask you'd forgive me for my pride and self-centeredness. Help me be humble Lord and to see others with the same love I see myself, for your glory Lord. Thank you for this day you have made and for how you have blessed me.","name":"IMG_3313.txt","index":205},{"verse":"Luke 14:13 ESV","verseRepeat":"But when you give a feast, invite the poor, thecrippled, the lame, the blind,","blurb":"OAP: God I ask you'd help me be a genuine giver to those who are in need not only those who can repay me back. I ask you'd convict me when I am only giving so that I can receive and that I would instead love as you love, to give to someone though they cannot repay and help me enjoy others for who they are. Help me love others as I love I     ,  Thank        We 4","name":"IMG_3309.txt","index":206},{"verse":"Luke 14:27 ESV","verseRepeat":"Whoever does not bear his own cross andcome after me cannot be my disciple.","blurb":"OAP: Lord, my life is easy. I ask inspire if this I never lose sight of you but keep you front and center. You are my source and security, not my job or money. You are my savior and it is you whom I will spend eternity with. I ask I'd be able to bear my cross and be your disciple. I ask you'd guide me in what this means and help me do it. Thank you for this day you have made and for saving my soul.","name":"IMG_3311.txt","index":207},{"verse":"Luke 14:33 ESV","verseRepeat":"So therefore, any one of you who does notrenounce all that he has cannot be my disciple.","blurb":"OA: God is the center of our lives. If we have him but lose all else we have everything still, though it may not feel that way. Everything we have likewise is his. All our life's fruit are a gift from God, and in the end the things of this life will fade away and when we pass we will not bring any possessions or titles with us. So in this life we should expend all we can to the glory of God and the advancement of his kingdom. P: Lord help me do this better than I do. All is yours and all material possessions and all my achievements will fade away with the passage of time. You however are eternal and those whom I am called to serve, my neighbor also is eternal. Help me be a positive force that reflects your likeness to others in love. Thank you for this day you have made and your word Lord.","name":"IMG_0558.txt","index":208},{"verse":"Luke 15:20 ESV","verseRepeat":"And he arose and came to his father. But while hewas still a long way off, his father saw him and feltcompassion, and ran and embraced him andkissed him.","blurb":"0: The God we serve delights in the repentance of his children. With great joy he reaches out to us most of the way as we only begin to approach him. He is a loving forgiving father. A: I should meditate how I am this son who squandered his inheritance and upon turning back to God he more than restored me and honored me far beyond what I deserved. I should glorify God for this and let others know that we have forgiveness offered to us. P: God thank you for boundless grace and your unending love. I am truly a blessed man, beyond my comprehension. Help me better understand this and for it to sink in. Also help me better explain it to others. Thank you for this day Lord, and your countless blessings.","name":"IMG_0565.txt","index":209},{"verse":"Luke 15:32 ESV","verseRepeat":"It was fitting to celebrate and be glad, for thisyour brother was dead, and is alive; he waslost, and is found.\"","blurb":"0: when we reach out to God a little, he reaches out to us much. A: take heart and have faith. Even though I am weak God is strong and my heart desires to please him. He will therefore give me the desires of my heart. P: God I ask I be pleasing in your sight and like your son. I thank you for this day you have made and how you have blessed us.","name":"IMG_3318.txt","index":210},{"verse":"Luke 16:10 ESV","verseRepeat":"\"One who is faithful in a very little is alsofaithful in much, and one who is dishonest ina very little is also dishonest in much.","blurb":"OAP: God help me be faithful with all that I do. Help me be a man of integrity and love for others, and I ask you'd bless the work of my hands to be pleasing in your sight. You have been good to me Lord. I ask you'd help me be good to others as well, to shine your light to them too.","name":"IMG_3320.txt","index":211},{"verse":"Luke 16:16-17 ESV","verseRepeat":"\"The Law and the Prophets were until John; sincethen the good news of the kingdom of God ispreached, and everyone forces his way into it. Butit is easier for heaven and earth to pass away thanfor one dot of the Law to become void.","blurb":"OA: though everyone in their own eyes considers themselves justified Nader the law - we do not mold the law to us- but rather it stands in judgement of us. And we are to seek what it says about us. The law should mold us, not the other way around. P: God you are good and your word and law are good. Help me never try to reshape it to fit my needs, but instead I ask your will would reshape me. Help me be a better imager of you and glorify you Lord. Thank you for this day you have made and my many blessings.","name":"IMG_0614.txt","index":212},{"verse":"Luke 16:22-23 ESV","verseRepeat":"The poor man died and was carried by theangels to Abraham's side. The rich man alsodied and was buried, and in Hades, being intorment, he lifted up his eyes and sawAbraham far off and Lazarus at his side.","blurb":"OAP: God I ask you'd steer my heart away from greed and self centeredness and instead outward to others. I ask I not spend this life enjoying material things when there are those around me who suffer from lack. Help me be skilled in loving others, and I ask for your forgiveness for so often delaying in doing this. All I have is from you and I ask I'd represent your son while I'm here.","name":"IMG_3321.txt","index":213},{"verse":"Luke 17:10 ESV","verseRepeat":"So you also, when you have done all that you werecommanded, say, We are unworthy servants; wehave only done what was our duty:\"","blurb":"OA: even in our best moments on these earth we are only doing what the Lord has commanded. None of us has a right to pride or self exaltation. Because our King has command us to greatness and obedience to him calls us to accomplish this. P: Lord help me be humble knowing that all I do is by your grace and all my efforts are simply my duty. Thank you for this day you have made and for the great blessing of family.","name":"IMG_0618.txt","index":214},{"verse":"Luke 17:17 ESV","verseRepeat":"Then Jesus answered, \"Were not tencleansed? Where are the nine?","blurb":"0: A common instinct of man is to forget God who is our miracle worker after the miracle. Of the ten lepers only one gave thanks to God. A: always take time to thank God for what he does for you. It is easy to forget. P: God I ask your forgiveness for the many times I have not given praise where it was do. Thank you for saving my soul and guiding and growing me as you have. For protecting me from many sins and giving me councilors. You are great Lord.","name":"IMG_3329.txt","index":215},{"verse":"Luke 17:28-29","verseRepeat":"when Lot went out from Sodom, fire andsulfur rained from heaven and destroyedthem all-","blurb":"0: I do not know what awaits me tomorrow. It could be one of many days or it could be the final day before Christ's coming, or the day of my death or that of a loved one. We know and control so little about the timing of things in our life. A: I should look to God for my foundation and stability. Nothing else in this world can I depend on in the same way. P: God you are my rock and foundation. I ask you'd make this truth alive in my heart and mind. Help me not lean on my own understanding or ability, but your grace as I go about all the unknowns in life","name":"IMG_3330.txt","index":216},{"verse":"Luke 18:9 ESV","verseRepeat":"He also told this parable to some who trustedin themselves that they were righteous, andtreated others with contempt:","blurb":"OA: I should not trust in myself and my own righteousness, but lean on Christ and what he has done. P: God I ask you'd help me learn this lesson and be a blessing to my family while we are here. Help me communicate with my father and please support him and help him grow. You are good Lord and I ask you continue his healing process. Thank you for this day you have made.","name":"IMG_3332.txt","index":217},{"verse":"Luke 18:14","verseRepeat":"who exalts himself will be humbled, but theone who humbles himself will be exalted.\"","blurb":"0: God does not call us to self promote as some do or to seek our own advancement, but instead to come before him in humility and ask forgiveness for how we have failed him. A: Know that you can not succeed your way to God's approval. It is not something we work our way towards but instead through grace and a contrite heart, God forgives us our sins. P: God I ask your forgiveness again. That you'd show your grace to myself and family. Help us all represent your son and glorify you. I thank you for family and this chance we have to see then","name":"IMG_3335.txt","index":218},{"verse":"Luke 18:25 ESV","verseRepeat":"For it is easier for a camel to go through the eye ofa needle than for a rich person to enter thekingdom of God.\"","blurb":"OAP: Lord I ask you'd protect me from greed. Help me balance providing for my family with giving to my community and to ministry in whatever way you would have me do. You are my master - not money or the world. Help my heart and life reflect this. Thank you for this day and glory to you lord.","name":"IMG_0629.txt","index":219},{"verse":"Luke 19:10 ESV","verseRepeat":"For the Son of Man came to seek and to savethe lost.\"","blurb":"OAP: God I ask that I'd never forget that you came to save the lost, myself included. Help me never give into self righteousness or think myself higher than I am. I am only anything by your grace. Thank you for my many blessings and this time I was able to have with family. You are great Lord. I ask you keep me far from foolishness and pride.","name":"IMG_3336.txt","index":220},{"verse":"Luke 19:20 ESV","verseRepeat":"Then another came, saying, 'Lord, here isyour mina, which I kept laid away in ahandkerchief;","blurb":"OAP: Lord help me never make this mistake, wrapping up and storing away what you have blessed me with. Help me use my talents, wealth, and spiritual gifts, all of which you have given me, well while I am here. I ask I alorifv you and multiple what you have I        Thank        You 111111111 iii ■ return","name":"IMG_3337.txt","index":221},{"verse":"Luke 19:23 ESV","verseRepeat":"Why then did you not put my money in the bank,and at my coming I might have collected it withinterest?'","blurb":"OAP: Lord I ask you'd help me use whatever you have given me, not for career advancement or worldly gain, but for your kingdom's advancement. I ask I'd invest what I have well, most of all in loving others and pointing them towards you. Help me be kind and loving and generous in a way that pleases you and helps another. Thank you for this day and glory to you.","name":"IMG_0630.txt","index":222},{"verse":"Luke 19:46 ESV","verseRepeat":"saying to them, \"It is written, 'My house shallbe a house of prayer,' but you have made it aden of robbers.\"","blurb":"OA: we should never confuse success and social standing with our relationship to God. The things of this world are here a minute and gone the next, but our spirits live on. P: Lord I ask I'd never make trivial what is sacred or sacred what is fleeting. I ask you'd keep me focused on doing good for others and I thank you for this day you have made and allowing me to use my talents to help others. I ask you'd guide me to do good and to do it well.","name":"IMG_3339.txt","index":223},{"verse":"Luke 20:25 ESV","verseRepeat":"He said to them, \"Then render to Caesar the thingsthat are Caesar's, and to God the things that areGod's.\"","blurb":"OA: I should try to not get caught up in political discourse or being preoccupied with it - instead making sure God is my chief focus. P: God I ask you'd help me always render to you the things that are rightfully yours. Thank you for this day you have made and I ask your forgiveness for often straying and focusing on other things. Thank you for work going well. To you be the glory Lord. Thank you for this day and my family and the baby I have yet to meet.","name":"IMG_0631.txt","index":224},{"verse":"Luke 20:25 ESV","verseRepeat":"He said to them, \"Then render to Caesar thethings that are Caesar's, and to God thethings that are God's.\"","blurb":"0: God does not instruct us here on exact rules of taxation. In this way we are shown, as we are in many things, that wise discretion is required to make many choices in life. A: I should avoid generalizations where the Bible has not made something plan. But in all matters not specified apply myself to wise council and reflection. P: God, I ask you'd make me wise in the choices I make and give me wise teachers to help me navigate murky issues. Help me see things rightly and make the right decisions.","name":"IMG_3341.txt","index":225},{"verse":"Luke 20:34-35","verseRepeat":"who are considered worthy to attain to thatage and to the resurrection from the deadneither marry nor are given in marriage,","blurb":"0: Jesus is not caught by the brain teaser where it seems no right answer is to be found. In telling the sadducees that we simply are not and do not marry in the next life, the whole assumed contradiction is shown to not exist. A: When presented with a choice that seems to be between two self defeating things, I should keep in mind that God knows far greater than I do, and that it may be a third we aren't privy to, or that only time will show. P: God thank you for the incredible world you have made filled with wonder and beyond man. Help me live we'll in-spite of my ignorance.","name":"IMG_3342.txt","index":226},{"verse":"Luke 20:46 ESV","verseRepeat":"\"Beware of the scribes, who like to walkaround in long robes, and love greetings inthe marketplaces and the best seats in thesynagogues and the places of honor atfeasts,","blurb":"OAP: God, I ask I never fall prey to this temptation to virtue signal rather than doing what is right because of what your son has done for me with no regard for selfish motives. Help me better live my life for others and to please you. Thank you for this day you have made and this time with my wife.","name":"IMG_3344.txt","index":227},{"verse":"Luke 21:3-4 ESV","verseRepeat":"And he said, \"Truly, I tell you, this poor widow hasput in more than all of them. For they allcontributed out of their abundance, but she out ofher poverty put in all she had to live on.\"","blurb":"OA: Our greatest act of love comes out of a place of great lack or exhaustion or poverty. We should expect in this life for God to call us to acts of service when we are not coming from a place of abundance, but from a place of impoverishment. P: Lord help me have the strength and resolve to give everything I have when the time comes to do so. Help me not lay down roots in the life and this world but help me always look toward your kingdom and the work that you are doing unseen by man. Thank you for this day you have made and my many blessings.","name":"IMG_0632.txt","index":228},{"verse":"Luke 21:36 ESV","verseRepeat":"But stay awake at all times, praying that youmay have strength to escape all these thingsthat are going to take place, and to standbefore the Son of Man.\"","blurb":"OAP: God I ask you'd help me stay alert to the fact that you are coming back. Help me live and think in a way that reflects the truths you reveal in your word. I ask you'd give me strength and wisdom to continue to move closer and not further from you. Help me gain a higher perspective and to serve and honor you in my day to day. Thank you for your many blessing over me and my family.","name":"IMG_3359.txt","index":229},{"verse":"Luke 22:27 ESV","verseRepeat":"For who is the greater, one who reclines at table orone who serves? Is it not the one who reclines attable? But I am among you as the one who serves.","blurb":"OA: In this world we have a certain notion of what is great - but the worlds notion of greatness is not the same as the one Jesus describes here. To be great we humble ourselves. In this way we are obedient to God in loving our neighbor and also we are like Christ who served us to the point of death though he was the greatest of us all. P: Help this lesson sink in for me Lord, help me not focus on the world's notion of greatness but on the one your son lay out here. Help me serve others without regard for my personal standing. Thank you for this day you have made.","name":"IMG_0636.txt","index":230},{"verse":"Luke 22:27 ESV","verseRepeat":"For who is the greater, one who reclines attable or one who serves? Is it not the one whoreclines at table? But I am among you as theone who serves.","blurb":"OAP: God, I ask you'd make me like your son, serving others over myself. Help me be more like your son and leading by becoming least rather than allowing myself to be driven by pride and self promotion. Thank you Lord for this day you have made and gifted to us. You have blessed us greatly and help us live a life that reflects the truth that all we have is yours. Our talents and possessions, all yours lord. May you be glorified by our lives.","name":"IMG_3345.txt","index":231},{"verse":"Luke 22:36-37 ESV","verseRepeat":"He said to them, \"But now let the one who has amoneybag take it, and likewise a knapsack. And letthe one who has no sword sell his cloak and buyone. For I tell you that this Scripture must befulfilled in me: 'And he was numbered with thetransgressors' For what is written about me has itsfulfillment.\"","blurb":"OA: Wisdom is often dynamic. The best thing to do is not always static but as Christians we need to be observant of our context to make the wise choice in our moment and place. The same course of action is not always called for. P: Lord help me know the difference between times where I do not need a knapsack and times when I need a sword for my travels. Help me discern my time and place and glory to you. All I have is yours lord. Help me serve others well in this time of heightened physical need and help me serve you well as a husband, father, son, and coworker. In all my relations I ask you'd guide me to loving service that knows no selfishness. Thank you for this day you have made and glory to you.","name":"IMG_0638.txt","index":232},{"verse":"Luke 23:45 ESV","verseRepeat":"while the sun's light failed. And the curtain ofthe temple was torn in two.","blurb":"OAP: God I ask you'd help me better understand what it means that the curtain that previously separated your presence from your followers was torn. Help me appreciate this gift I've been given of being in a age where I can be in your presence because of the power of your sons sacrifice for me. Thank you for this love and grace you have show to me and all who believe. I ask for wisdom and guidance in navigating these truths and thank you for this day.","name":"IMG_3362.txt","index":233},{"verse":"Luke 24:51 ESV","verseRepeat":"While he blessed them, he parted from themand was carried up into heaven.","blurb":"0: Christ lives on even now though a great swath of time has passed in the eyes of man, Christ still reigns having conquered death. A: I should take heart when times are hard and reflect on how my savior lives. Because he does. P: God, glory to you and thank you for the blessing of your son. Thank you for your word that you have gifted to us as a testament. Help me never forget that Christ lives.","name":"IMG_3363.txt","index":234},{"verse":"1 John 3:24 ESV","verseRepeat":"Whoever keeps his commandments abides in God,and God in him. And by this we know that heabides in us, by the Spirit whom he has given us.","blurb":"OA: Our relationship with God drives us to no longer sin, and also steers us to loving others. These are two sides of the same coin. We are to glorify God through obedience and out of obedience love others as his son has loved us. We are incapable of obedience without love, and we are incapable of truly loving if we are in sin. P: God I ask you'd help me be both obedient to your law and through that obedience love others as your son did as he lived obediently to you. Thank you for this day you have made.","name":"IMG_0014.txt","index":235},{"verse":"1 John 4:20 ESV","verseRepeat":"If anyone says, \"I love God,\" and hates his brother,he is a liar; for he who does not love his brotherwhom he has seen cannot love God whom he hasnot seen.","blurb":"0: It is often much easier to love the seen and those close to us than it is to love that which we cannot see and may feel distant at times. A: I should seek to love others more and more, and in doing so learn to love and seek after God more and more. P: God I thank you for this day you have gifted to me filled with family. You have blessed me greatly Lord, in this life as well as through the salvation of my soul, the next life. I ask you'd help me love those I can see and be more like you. In Jesus name I pray, Amen.","name":"IMG_0016.txt","index":236},{"verse":"1 John 5:19 ESV","verseRepeat":"We know that we are from God, and the wholeworld lies in the power of the evil one.","blurb":"OA: Christians should fully expect for the world to be against what they truly are and attempt to undercut them. The main stage will never be for true Christianity. The evil one would never permit it until Christ's return, and it is presently in the evil ones hands that the world sits in. P: God thank you for your son's sacrifice and my salvation that I may know you though I was born into this world with sin and was slave to my flesh. I ask you'd help me continue this journey and keep my eyes focused on where you would have me go. You are great and greatly to be praised lord.","name":"IMG_0017.txt","index":237},{"verse":"1 John 4:18 ESV","verseRepeat":"There is no fear in love, but perfect love casts outfear. For fear has to do with punishment, andwhoever fears has not been perfected in love.","blurb":"OA: when we are fully aware of God's love for us the we are able to be bold and fearless no matter what challenges we may face because we know in the end our fate is sealed and our God is good. I should take heart then when I grow worried or afraid for God is with me and I am loved by him. P: Lord you are my good and wise teacher. You guide me and are patient with me in my missteps. Glory to you Lord. All I have is yours. Thank you for this day you have made and your word and my family. In your sons name I pray, amen.","name":"IMG_0659.txt","index":238},{"verse":"1 John 5:19 ESV","verseRepeat":"We know that we are from God, and the wholeworld lies in the power of the evil one.","blurb":"OAP; Lord help me love the world as your son did but not be of it. Help me love my neighbor while not coveting their approval. Help me be kind to others and speak truth in wisdom. Help me be wise beyond my years that I honor your name. Help me work hard but never serve money. Help me give generously but not without good discernment. Help me forgive others and also stand strong for all true justice. Help me know when not to speak, and he me only speak out when it is good in your sight. Help me engage with others but not become consumed with current events. You are greater than today's issues, and all issues to come. Thank you for this day you have made and your word. In your sons name I pray, amen.","name":"IMG_0660.txt","index":239},{"verse":"2 John 1:5 ESV","verseRepeat":"And now I ask you, dear lady—not as though I werewriting you a new commandment, but the one wehave had from the beginning—that we love oneanother.","blurb":"OAP: Lord I ask you'd help me never lose sight of the fact that I am to love my neighbor and love you. These two simple edicts lord I often forget in my daily walk. I ask you'd guide me to never pray from these laws. Thank you for this day you have made, for your word, for your salvation, and for your material blessings that provide for me and my family.","name":"IMG_0662.txt","index":240},{"verse":"3 John 1:10 ESV","verseRepeat":"So if I come, I will bring up what he is doing, talkingwicked nonsense against us. And not content withthat, he refuses to welcome the brothers, and alsostops those who want to and puts them out of thechurch.","blurb":"OAP: Lord help me always be ready to speak truth even if it leads to confrontation if it needs to be done. Help me be wise in knowing when it is that time or not that I not cause trouble unnecessarily. Help me also be courageous when the truth needs to be spoken and to speak it well. Thank you for this day God. I ask you'd be with me and Libby in this uncertain time, and that you'd provide clarity. In Jesus name I pray, amen.","name":"IMG_0663.txt","index":241},{"verse":"John 1:10 ESV","verseRepeat":"He was in the world, and the world was madethrough him, yet the world did not know him.","blurb":"OAP: Lord I thank you that I may know you. Thank you for your word that you have shared with us through the hands of men. Thank you for the example your son has set for us that we may live in accordance to your will. You are great and I am greatly blessed. I ask you'd give me wisdom and guidance in all things. In Jesus name I pray, amen.","name":"IMG_0679.txt","index":242},{"verse":"John 1:49 ESV","verseRepeat":"Nathanael answered him, \"Rabbi, you are the Sonof God! You are the King of Israel!\"","blurb":"OA: Jesus, the son of God, is our king and ruler on this earth. Not only over Israel but anywhere. We are his salt of the earth and we are to go out and be his hands and feet to a hurting world in need of a savior. P: Lord I ask you'd equip me to be a member of your kingdom. Help me be an ambassador for you and glorify you in how I speak with others and in how I behave help me be genuine wise and good. Thank you for this day and grafting me and my family into yours.","name":"IMG_0687.txt","index":243},{"verse":"John 2:17 ESV","verseRepeat":"His disciples remembered that it was written, \"Zealfor your house will consume me.\"","blurb":"OAP: God I ask in a similar way to how your son in zeal flipped the tables and forced out the money changers, that I too would defend what is right at the right time. Help me be unafraid to do the assertive things of it is the right time and place. Help me be bold, without fear, defending what is right. Thank you for this day you have made and please be with my wife.","name":"IMG_0170.txt","index":244},{"verse":"John 3:30 ESV","verseRepeat":"He must increase, but I must decrease.\"","blurb":"OA: Our lives should always be an effort to deemphasize ourselves and exalt and lift up Christ - our Lord and Savior. P: God I ask you'd forgive me for when I have really failed to do this. You are great Lord and greatly to be praised. I am not the center but you are the center. And all I have is by the grace of your hands. Thank you for your abundant blessings God. Help me deemphasize myself and lift up you. Thank you for this day you have made and my countless blessings","name":"IMG_0171.txt","index":245},{"verse":"John 4:39 ESV","verseRepeat":"Many Samaritans from that town believed in himbecause of the woman's testimony, \"He told me allthat I ever did.\"","blurb":"OAP: God I ask you'd help me articulate my testimony to the benefit of others and your glory. I ask that like this woman you'd give me the words to praise you and let others know what all you have done and continue to do for me. Thank you for thus day you have made and for giving my wife safe journeys. Please encourage and strengthen her and thank you for the great blessing she is over my life. You are great and greatly to be praised Lord. Help me praise you to others better I ask in your son's name.","name":"IMG_0172.txt","index":246},{"verse":"John 20:29 ESV","verseRepeat":"Jesus said to him, \"Have you believed becauseyou have seen me? Blessed are those who havenot seen and yet have believed.\"","blurb":"OA: Because we who have come after those that saw Christ raised in the flesh have not seen it ourselves, we are blessed by God to have faith that arises to fill that gap. I should be grateful for the life God has breathed into me though I have not seen my king in the flesh. P: God I ask you'd teach me more what it is to be blessed by having never seen your son in this life. Thank you for this day and what it represents - that your son was raised and by him we live. You are great God and worthy of praise.","name":"IMG_0525.txt","index":247},{"verse":"John 21:25 ESV","verseRepeat":"Now there are also many other things that Jesusdid. Were every one of them to be written, Isuppose that the world itself could not contain thebooks that would be written.","blurb":"OA: Christ did so many things just while on earth that all the tomes in the world could not contain it. And his miracles and works continue to this day. God is great and the son of God is the king of all creation, our savior and Lord, and we should always strive to maintain our childish wonder at what God has done for us. P: God glory to you. Thank you for your sacrifice for me that was unwarranted. You are my savior and a gracious God. Thank you for this. You have given me plenty and saved my soul and for this I am grateful. I am a very blessed man.","name":"IMG_0527.txt","index":248},{"verse":"Acts 2:46 ESV","verseRepeat":"And day by day, attending the temple together andbreaking bread in their homes, they received theirfood with glad and generous hearts,","blurb":"OAP: God I ask you'd make in me a grateful heart and someone that is active in my community. Help me be an aid to those in need that suffer, to those who could never repay my generosity. You are great Lord, and I ask I be empowered to reflect you to others and be content- not seeking after vain things like the world but seeking Christ glorified. Thank you for this day you have made.","name":"IMG_0229.txt","index":249},{"verse":"Acts 4:13 ESV","verseRepeat":"Now when they saw the boldness of Peter andJohn, and perceived that they were uneducated,common men, they were astonished. And theyrecognized that they had been with Jesus.","blurb":"O:when we have proven ourselves weak or are of low station God receives all the glory for the things we do. A: Always give God the praise. If you succeed at anything in life let it be known that it is God through you and by the grace of his son Jesus. P: God I ask you'd be glorified through my life. I ask I'd direct people to you and right thinking toward you. You are my provider and King and by you I stand. Glory to you God, Ruler of my house.","name":"IMG_0230.txt","index":250},{"verse":"Acts 5:41 ESV","verseRepeat":"Then they left the presence of the council,rejoicing that they were counted worthy to sufferdishonor for the name.","blurb":"0: when we suffer for the sake of Christ's kingdom, we are being given an honor by being closer to Christ in how he too suffered. If God uses us to play any part in his kingdom it is a great honor to us. A: I should be grateful for any kingdom involvement God has in store for me, big or small it is a great honor, and the greatest possible honor of my life. P: God I ask you'd help me remember this and that you remove from me all pride so that I never think what part others get to play relative to me but that I get to play any part at all in this kingdom. Glory to you and thank you for this day you have made.","name":"IMG_0233.txt","index":251},{"verse":"Acts 6:3-4 ESV","verseRepeat":"Therefore, brothers, pick out from among youseven men of good repute, full of the Spirit and ofwisdom, whom we will appoint to this duty. But wewill devote ourselves to prayer and to the ministryof the word.\"","blurb":"OA: Not everyone in Gods kingdom has the same role at all times. God has made each of us for a place and time for his kingdom and we are to seek after that, not any particular role. P: God I ask you'd remove all selfish pride from me, that whatever you have for me I would do. I thank you for the incredible blessings you've put over me, and for providing for me again and again. Please blessed my house, family and community and country. Thank you for this day you have made.","name":"IMG_0234.txt","index":252},{"verse":"Acts 7:60 ESV","verseRepeat":"And falling to his knees he cried out with a loudvoice, \"Lord, do not hold this sin against them.\"And when he had said this, he fell asleep.","blurb":"0: Stephen's last act before being killed was to ask that God forgive his killers. In this way Stephen reflected the same love the savior had for us. We are imagers of God, and when he saves and redeems us and through his spirit dwells in us we become more like him. A: Seek more of God not taking your eye off the real goal in life - which is to advance God's kingdom. P: God I ask you'd empower me to do things like what Stephen did. To know your grace so well that my last act could be one of grace to my enemies. I ask you'd teach me this and help me be more like you Lord. Thank you for this day you have made and for empowering Stephen that I could be inspired by his story","name":"IMG_0236.txt","index":253},{"verse":"Acts 9:15 ESV","verseRepeat":"But the Lord said to him, \"Go, for he is a choseninstrument of mine to carry my name before theGentiles and kings and the children of Israel.","blurb":"OAP: God you choose us. By your grace we are able to become something greater than what is of this world. By your grace we reflect your image acting as your hands and feet. I ask you'd empower me to do what is right and good and to be a light to others God. Thank you for this day you have made. I ask you'd empower me to do good for your kingdom, and I ask for supporting friends in the faith Lord. I ask me and Libby find a church. Thank you for this day and your many blessings.","name":"IMG_0238.txt","index":254},{"verse":"Acts 10:34-35 ESV","verseRepeat":"So Peter opened his mouth and said: \"Truly Iunderstand that God shows no partiality, but inevery nation anyone who fears him and does whatis right is acceptable to him.","blurb":"0: The church is global in nature. God does not prefer one people group over another by national lines. Instead it is determined by those who are loyal to him, our king. A: Honor God in all your ways, glorifying him often, seeking his aid when in need, and keeping his commands. P: God, you are my savior and Lord. All I have and am, is by your grace. You are a great and good king, and I ask you defend me and Libby from plots of the enemy for our destruction. Thank you for this day you have made and glory to your name.","name":"IMG_0239.txt","index":255},{"verse":"Acts 11:29 ESV","verseRepeat":"So the disciples determined, every one accordingto his ability, to send relief to the brothers living inJudea.","blurb":"OAP: God I ask you'd cultivate in me a generous love for others, that drives me to give as I am able, for your glory and the benefit of the whole body of Christ. I thank you for the wealth you have blessed me and Libby with both in money and in talents. I ask we use those as we are able to the benefit of your body and our neighbor. Help us spread your word and that you are a good King and our rightful king. I thank you for this day you have made Lord and for your steady protection over us.","name":"IMG_0240.txt","index":256},{"verse":"Acts 12:24 ESV","verseRepeat":"But the word of God increased and multiplied.","blurb":"OA: through Gods power, his church can succeed in spite of any opposition. We are on a sacred mission to see him glorified and all brought back to the fold, and with God it is possible. P: God I ask you'd strengthen me and my family, that we would glorify you and spread your message of hope and love. You are great Lord. Thank you for this day you have made and how you have blessed us so richly.","name":"IMG_0243.txt","index":257},{"verse":"Acts 13:39 ESV","verseRepeat":"and by him everyone who believes is freed fromeverything from which you could not be freed bythe law of Moses.","blurb":"OAP: God your are my liberator. By your grace and blessing I am set free. I ask you'd empower me to free others and steer them towards you. Help me point others to face you God, to glorify you and also find freedom in you. Christ has payed the price and done what the law could not. I ask I would better take up my freedom and all that means. Help me also be a source of encouragement to the body of Christ. Your will be done Father. Thank you for this day you have made and blessed me with.","name":"IMG_0247.txt","index":258},{"verse":"Acts 14:22 ESV","verseRepeat":"strengthening the souls of the disciples,encouraging them to continue in the faith, andsaying that through many tribulations we mustenter the kingdom of God.","blurb":"OA: it is normal for us to face trials if we are trying to do the will of God and live for his kingdom rather than the kingdom of this world. I should take heart and be on the look out for these struggles, and know they are expected and they are a sign that I may be on the right track. P: God I ask you'd equip me for whatever trails lie ahead. Help me not compromise on my dedication to you and help my dedication go deeper. You are my God and king and all I have is because of you and your grace. Thank you Lord for all your many blessings over me.","name":"IMG_0248.txt","index":259},{"verse":"Acts 15:11 ESV","verseRepeat":"But we believe that we will be saved through thegrace of the Lord Jesus, just as they will.\"","blurb":"0: None of us have earned our salvation. It is by the saving grace of our king, Jesus, that we are saved. I have been saved by his grace. A: I should meditate on this and praise God for it through word and deed for I have been saved by grace. God is good and worthy of praise. P: thank you for your saving grace Lord. You are my god and king and your provide all my needs. By your grace I stand. Thank you for this day you have made and I ask your blessing and protection over the next. In Jesus name I pray.","name":"IMG_0250.txt","index":260},{"verse":"Acts 16:14 ESV","verseRepeat":"One who heard us was a woman named Lydia,from the city of Thyatira, a seller of purple goods,who was a worshiper of God. The Lord opened herheart to pay attention to what was said by Paul.","blurb":"0: God opens our heart to hear truth. We often are unable to see truth for what it is until God shows us, either through movements of the spirit in us, or through those who he has placed in our lives. Either way when a member of the Body of Christ speaks to us - it is ultimately God speaking and opening our heart. AP: God I thank you for how you have opened me up to the truth and help me see and continue to clear my vision of the truth. I ask you'd open those on my heart to the truth, that they could know you as I know you. Thank you for this day you have made and your many blessings.","name":"IMG_0252.txt","index":261},{"verse":"Acts 17:16-17 ESV","verseRepeat":"Now while Paul was waiting for them at Athens, hisspirit was provoked within him as he saw that thecity was full of idols. So he reasoned in thesynagogue with the Jews and the devout persons,and in the marketplace every day with those whohappened to be there.","blurb":"0: Paul was prepared to reason and persuade people of different faiths than himself. A: I too should seek to be able to speak my faith to others that they may know Christ as I do. I should not be timid about the truth but be bold about it. P: God I ask you'd give me wisdom and that your spirit would empower me so that I could spread your word to others Lord. I ask you'd give me insight in how to speak or when not to speak. Thank you for this day you have made and your many blessings.","name":"IMG_0254.txt","index":262},{"verse":"Acts 19:19-20 ESV","verseRepeat":"And a number of those who had practiced magicarts brought their books together and burnedthem in the sight of all. And they counted the valueof them and found it came to fifty thousand piecesof silver. So the word of the Lord continued toincrease and prevail mightily.","blurb":"OA: Sometimes for our own good, God calls us to give up something that is special and valuable to us because it is inappropriate for someone in his kingdom to possess or it was obtained wrongly.it may even just be a stumbling block that is not wrong in and of itself but an unwise thing to possess. In all cases I should be prepared to give up valued temporary things at a moments notice if my King, the lord, wills it. P: God guide my heart to dispossess anything that would do me harm. I ask you'd be glorified through me and that things in my life that would hinder that you would cast away. Thank you for this day you have made and for a pleasant church service today. In your son's name I pray, Amen","name":"IMG_0255.txt","index":263},{"verse":"Acts 20:35 ESV","verseRepeat":"In all things I have shown you that by working hardin this way we must help the weak and rememberthe words of the Lord Jesus, how he himself said,'It is more blessed to give than to receive' \"","blurb":"OAP: God I ask you'd open my heart to opportunities to minister to others and aid the weak. Help me be wise and loving to other and lift them up as Paul did that I can point others to you Lord. You are everything God, and I ask you'd reside in my mind more and be in my deeds more. To you be the glory, and your will be done. Thank you for this day you have made.","name":"IMG_0256.txt","index":264},{"verse":"Acts 23:5 ESV","verseRepeat":"And Paul said, \"I did not know, brothers, that hewas the high priest, for it is written, 'You shall notspeak evil of a ruler of your people:\"","blurb":"OA: Though Paul was being beaten and abused by those in power, when he realized he was condemning the leader of the people he repented out of respect. I believe I too should be respectful of my leadership good or bad, and not dishonor them. P: God help me do this well and for it to stay firmly in my mind that I not disrespect those in authority above me. Most of all your son, my present king. Thank you for this day you have made and the blessing of your word.","name":"IMG_0257.txt","index":265},{"verse":"Acts 24:24-25 ESV","verseRepeat":"After some days Felix came with his wife Drusilla,who was Jewish, and he sent for Paul and heardhim speak about faith in Christ Jesus. And as hereasoned about righteousness and self-controland the coming judgment, Felix was alarmed andsaid, \"Go away for the present. When I get anopportunity I will summon you.\"","blurb":"OAP: God I ask as Paul, even when imprisoned, glorified you and tried to spread the good news of your son and speak truth even to his captors, I ask you'd give me this same courage. Help me speak well and speak as often as I should, whether a lot or a little. Please empower me to spread the good news of your sons sacrifice that saves us from our sins. Help my life be a reflection of you as a loving act of worship. Your will be done God. Thank you for this day you have made and your many blessings.","name":"IMG_0258.txt","index":266},{"verse":"Acts 25:11 ESV","verseRepeat":"If then I am a wrongdoer and have committedanything for which I deserve to die, I do not seek toescape death. But if there is nothing to theircharges against me, no one can give me up tothem. I appeal to Caesar.\"","blurb":"OA: A Christian man does not seek to evade the consequences of his actions. He confronts his wrongs before man boldly knowing that before his God and king he has been declared innocent by the blood of Christ. P: God I ask your mercy would embolden me. Your sons sacrifice has made me new and there is nothing left for me to fear. So when I make mistakes present or future, there is nothing to fear. Help me never try to compensate a wrong with dishonesty. Thank you for this day you have made Lorx.","name":"IMG_0261.txt","index":267},{"verse":"Acts 28:5 ESV","verseRepeat":"He, however, shook off the creature into the fireand suffered no harm.","blurb":"0: all earthly threats are nothing compared to God and nothing can stop his plans. A: Always take heart in God being able to see you through whatever it is that is facing you. His intentions cannot be stopped by the things of earth . he will make all things good in the end, no matter what comes. P: God help me stay faithful and to be a good spouse and lift Libby up as well. I asked you strengthen us to believe in our hearts that you will always see us through. You are good Lord and thank you for this day you have made.","name":"IMG_0266.txt","index":268},{"verse":"Acts 28:30-31 ESV","verseRepeat":"He lived there two whole years at his own expense,and welcomed all who came to him, proclaimingthe kingdom of God and teaching about the LordJesus Christ with all boldness and withouthindrance.","blurb":"OA: Paul with open arms would welcome others and speak about to folks about Jesus whenever they were willing to listen. He was bold in his testimony and I should try to be likewise. P: Lord I ask you'd give me a courage and a wisdom to spread your word and tell others of your Kingdom and about your son and what he has done for us all. Thank you for this day you have made and your many blessings Lord.","name":"IMG_0267.txt","index":269},{"verse":"Romans 1:32 ESV                                   Though they know God's righteous decree that      those who practice such things deserve to die,    they not only do them but give approval to those  who practice them.","verseRepeat":"Romans 1:32 ESV                                   Though they know God's righteous decree that      those who practice such things deserve to die,    they not only do them but give approval to those  who practice them.Though they know God's righteous decree that      those who practice such things deserve to die,    they not only do them but give approval to those  who practice them.those who practice such things deserve to die,    they not only do them but give approval to those  who practice them.they not only do them but give approval to those  who practice them.who practice them.","blurb":"0: it is not shocking that our culture glorifies  things that Paul lays out here as abhorrent. things that Paul lays out here as abhorrent. Not only are some in rebellion but they are proud of that rebellion. A: be prepared to have to stand your ground counter to what culture is pushing for. The world may see you as immoral for believing what you do. To those that are backwards the right way seems wrong. P: help me always stand my ground on issues you have made plain Lord. Help my convictions be strong and to stand by them, though I would be belittled in the eyes of the world.","name":"IMG_0021.txt","index":270},{"verse":"1 Corinthians 11.V1:1 tbv","verseRepeat":"No temptation has overtaken you that is notcommon to man. God is faithful, and he willnot let you be tempted beyond your ability,but with the temptation he will also providethe way of escape, that you may be able toendure it.","blurb":"OAP: Lord, I ask that I'd never be fooled by the lie that there is no hope for me to do anything but sin against you. This is never true Lord and I ask that I'd never believe it. Help this passage stay in my mind when temptations are great. I also pray lord that you'd like me away from temptations! Help me be wise that I never stumble into temptation in the first place. Thank you for this day you have made and thank you for blessing us with a church of good people.","name":"IMG_3169.txt","index":271},{"verse":"1 Corinthians 5:6-7 ESV","verseRepeat":"Your boasting is not good. Do you not knowthat a little leaven leavens the whole lump?Cleanse out the old leaven that you may be anew lump, as you really are unleavened. ForChrist, our Passover lamb, has beensacrificed.","blurb":"OA: we are to not have a bit of this world in us. But totally for Christ. And a disciple of his. We are unleavened by this world and should not tolerate any compromise in God's call and law. P: God I ask you'd help me be wise and love others as your son does and demonstrated on the cross. Help me do good by others and to be fully in the world but not of it. Thank you for this day.","name":"IMG_3161.txt","index":272},{"verse":"1 Corinthians 6:2 ESV","verseRepeat":"Or do you not know that the saints will judgethe world? And if the world is to be judged byyou, are you incompetent to try trivial cases?","blurb":"0: Christians are to be discerning in their judgements, and wise in their conclusions. We are not to reserve judgement, but judge rightly and justly with the spirit within us as our guide. A: I should seek to cultivate wisdom in myself and be discerning in my judgements and to fight for justice. P: God help me not give in to one of the spirits of this age of soft judgement. Let my judgements be firm and right, and uncompromising, and loving and glorifying to you. Thank you for this day and this word.","name":"IMG_3163.txt","index":273},{"verse":"1 Corinthians 7:17 ESV","verseRepeat":"Only let each person lead the life that theLord has assigned to him, and to which Godhas called him. This is my rule in all thechurches.","blurb":"0: each of us is in a unique position and role in society. Coming to God is not also coming to an earthly status. He takes us as we are and we are not judged by the world. A: do not participate in the rat race of career growth or money. Instead have your mind on pleasing God. P: God help this truth sink into my heart and let me be defined by you, not by this world. Help me do good.","name":"IMG_3164.txt","index":274},{"verse":"1 Corinthians 8:11 ESV","verseRepeat":"And so by your knowledge this weak personis destroyed, the brother for whom Christdied.","blurb":"0: a true thing said at a wrong time can destroy a person. There is a right time to say a thing and a wrong time. It is not as simple as always speak the truth you know. A: I should be discerning in my speech and think on when it is a good time to share and when it is not. Not all times are equal for speaking all things P: God help me be wise in this and speak truth when it builds up other. And not just whenever I have the opportunity. Help me be wise and thank you for this day.","name":"IMG_3167.txt","index":275},{"verse":"1 Corinthians 9:10 ESV","verseRepeat":"Does he not certainly speak for our sake? Itwas written for our sake, because theplowman should plow in hope and thethresher thresh in hope of sharing in the crop.","blurb":"OA: we should seek to prosper so that we can share our prosperity with others, and it is to our benefit that we share what we gain, so that our hearts are turned to God and not the things of this world. We should work hard in hope of benefiting others well. P: God help me do this. Turn my heart to you and with it turned to you, to others. Help me love and care for others and seek their good, for your glory.","name":"IMG_3168.txt","index":276},{"verse":"1 Corinthians 12:11 ESV","verseRepeat":"All these are empowered by one and the sameSpirit, who apportions to each one individually ashe wills.","blurb":"OAP: Lord I ask you'd guide me in the correct use of the spiritual gifts you have blessed me with and help me lead Libby to excellent use of her gifts as well. I pray that we'd rise to whatever call you have for us we'll and in the name of your Son glorifying him while we serve you. Please empower me to do well and in a way that pleases you. Your will be done God.","name":"IMG_0173.txt","index":277},{"verse":"1 Corinthians 12:12 ESV","verseRepeat":"For just as the body is one and has manymembers, and all the members of the body,though many, are one body, so it is with Christ.","blurb":"OAP: God I ask you'd steer me and Libby to be a part of the larger body of Christ here on earth however you would see fit. You are our savior and Lord and we will go where you lead us. I ask you'd help us make a good decision here and to serve the ones we go to church with. Thank you for this day you have made Lord and for your word. You are a good God","name":"IMG_0147.txt","index":278},{"verse":"1 Corinthians 12:20 ESV","verseRepeat":"As it is, there are many parts, yet one body.","blurb":"OAP: God I ask you'd help me contribute to the body of the church I am in. Help me support it and serve it in an effective and wise way that brings you joy. Help me see that others are a part of this larger body, just as I am, our souls of equal weight in the same cause. Help me see my church family as a true family and to love them as I do my own. I ask you'd bless them lord and help me be a blessing to them.","name":"IMG_3171.txt","index":279},{"verse":"1 Corinthians 13:6 ESV","verseRepeat":"it does not rejoice at wrongdoing, but rejoices withthe truth.","blurb":"OAP: God I ask you'd steer my heart and speech to be good and uplifting, to focus on what is righteous and praiseworthy and to not take part in lowering talk. Help me raise others when they feel weak as your son did, and if the occasion is right - speak truth to power and condemn pride. Help me not seek the failure of competitors but shape my heart to support the success of others as though it were my success personally. Thank you for this day you have made and this time with friends and coworkers. Help me have a godly impact.in Jesus name I pray, amen.","name":"IMG_0150.txt","index":280},{"verse":"1 Corinthians 13:13 ESV","verseRepeat":"So now faith, hope, and love abide, thesethree; but the greatest of these is love.","blurb":"OAP: God, I ask that I would have love. Please help me reflect the virtues Paul lays out here. To be patient and kind. To not be irritable or push for my own way. Help my mindset shift towards the betterment of others and not myself. I ask you'd help me love as you love. Help be be loving to my family, my coworkers, my community, our church body here. God I ask you'd make me a blessing to them and that I reflect the blessings and love you pour out on me. You are great and greatly to be praised","name":"IMG_3174.txt","index":281},{"verse":"1 Corinthians 14:31-33 ESV","verseRepeat":"For you can all prophesy one by one, so thatall may learn and all be encouraged, and thespirits of prophets are subject to prophets.For God is not a God of confusion but ofpeace. As in all the churches of the saints,","blurb":"OAP: help me promote peace lord. In my heart, mind, home, and for my neighbors. And help me be wise and discerning, knowing that just because something is good does not always mean it is a wise thing to do at that time in that context. Help me also remember this when considering certain topics. You are great Lord and thank you for this day","name":"IMG_3176.txt","index":282},{"verse":"1 Corinthians 14:39 ESV","verseRepeat":"So, my brothers, earnestly desire to prophesy, anddo not forbid speaking in tongues.","blurb":"OAP: God I ask you'd bring true prophets into your church to guide our steps that we not stumble, but would do your will instead. Help us be of one mind and receive reliably prophecies and to know the true from the false. Thank you for this day you made Lord and this chance I have had to bond with friends and co workers. You are good God and worthy to be praised. I ask you'd bring us true prophets.","name":"IMG_0154.txt","index":283},{"verse":"1 Corinthians 15:37-38 ESV","verseRepeat":"And what you sow is not the body that is to be, buta bare kernel, perhaps of wheat or of some othergrain. But God gives it a body as he has chosen,and to each kind of seed its own body.","blurb":"OA: we will have an entirely new body in the next life, like a seed is to the final plant, it will be different in kind and form - and far more glorious than this present day, restored and made right. P: God I thank you for this incredible promise you have set over us and for what all this means. Thank you for this day you have made and for safe travels.","name":"IMG_0160.txt","index":284},{"verse":"1 Corinthians 15:37 ESV","verseRepeat":"And what you sow is not the body that is tobe, but a bare kernel, perhaps of wheat or ofsome other grain.","blurb":"0: our present bodies are a kernel of what is to come, so what we have now is a piece but what awaits is something in the image of our creator. A: I should look at all my brothers and sisters in Christ and know that in regardless of how they presently appear a glorious resurrection will await where a new body and a renewed mind is inherited, in Christ's image. P: God help me see others as you do. Help me love others and care for them as I care for myself, for I am not the center but you are and they are all my brothers and sisters","name":"IMG_3177.txt","index":285},{"verse":"1 Corinthians 16:13 ESV","verseRepeat":"Be watchful, stand firm in the faith, act like men,be strong.","blurb":"OAP: God I ask you'd help me be watchful, firm in the faith, and to be manly and strong to fulfill my role and glorify you in doing so. Thank you for this day you have made and for your word. I ask you'd continue to shape me to be like your son, for your glory. All good things I have and have done are by your hand Lord and I ask I'd not soon forget that. I am very blessed.","name":"IMG_0161.txt","index":286},{"verse":"2 Corinthians 1:5 ESV","verseRepeat":"For as we share abundantly in Christ's sufferings,so through Christ we share abundantly in comforttoo.","blurb":"OAP: God I ask you'd comfort us where we are, as our comforter. Give us strength and encouragement. Please be with us and defend us from our affliction. Thank you for this day you have made Lord. Please protect and keep us, and give us peace.","name":"IMG_0163.txt","index":287},{"verse":"2 Corinthians 10:18 ESV","verseRepeat":"For it is not the one who commends himself who isapproved, but the one whom the Lord commends.","blurb":"OAP: God I ask my self worth and my goal would always come from you. The world is not my judge, but you are Lord. You are everything, and this whole world is a spec compared to you. Thank you for blessing me so greatly and for your daily mercies that forgive me for falling short. I thank you that through your sons atonement I can be before you, as one of your children. Thank you for this day you have made and glory to you. Your will be done and not mine Lord.","name":"IMG_0130.txt","index":288},{"verse":"2 Corinthians 12:9 ESV","verseRepeat":"But he said to me, \"My grace is sufficient for you,for my power is made perfect in weakness.\"Therefore I will boast all the more gladly of myweaknesses, so that the power of Christ may restupon me.","blurb":"0: As Christians we can boast in our weakness, because then any good that occurs from us can be attributed to Christ alone, so to boast in our weakness is to boast in God's grace. A: Always point others to God if they look to you. Especially if they look up to you. Give them reason to look to God and know that it is by his grace you stand. P: God help me testify through my life to glorify you. Thank you. Though I am weak you are strong and through you and your empowering I can and have done great things but it is all you Lord. Nothing is from me. You are gracious and merciful to me. You are good lord. Thank you for this day you have made and how you have blessed me and my family.","name":"IMG_0140.txt","index":289},{"verse":"2 Corinthians 12:14 ESV","verseRepeat":"Here for the third time I am ready to come to you.And I will not be a burden, for I seek not what isyours but you. For children are not obligated tosave up for their parents, but parents for theirchildren.","blurb":"OAP: God help me Love others the way Paul illustrates here, where I will want nothing that is theirs but want them. Help me be selfless and forgetful of myself as I lay down my life for others. Help me become less that you may become greater. Help me enjoy the great parts of others with little reflection in myself or ends. Give me your eyes to see others and to demonstrate your sons love outwardly to them. Help me be a light. Thank you for this day and your word and for teaching me love through your son and his sacrifice. Help me understand it better that I may glorify you more boldly. You are great and worthy of all praise.","name":"IMG_0142.txt","index":290},{"verse":"Ephesians 4:31 ESV","verseRepeat":"Let all bitterness and wrath and anger and clamorand slander be put away from you, along with allmalice.","blurb":"OAP: God I ask you'd expose areas in my speech and thought where I have failed to do this. Help me be calm and loving, and I ask you'd forgive me for having over confidence in my future prediction capabilities or in my preoccupying worry about the future. I ask your forgiveness for falling into fear and getting caught up in the concerns of the world. Help me be concerned with your kingdom instead, not fearing what may happen to it, but in joy and excitement advance what it is you are doing. Help me do more and do it well. Thank you for this day Lord and have you have blessed me so richly. You are great and I am unworthy of the grace you give me daily.","name":"IMG_0226.txt","index":291},{"verse":"Ephesians 5:4 ESV","verseRepeat":"Let there be no filthiness nor foolish talk norcrude joking, which are out of place, butinstead let there be thanksgiving.","blurb":"OAP: God I ask you'd help me speak well, and when there is nothing to speak - that I would not speak at all. Help me not speak in the ways of this world, not being religious, but with good sense. Give me wisdom to know the difference between times when I should speak and when I shouldn't and thank you for this day that you have made","name":"IMG_3353.txt","index":292},{"verse":"Ephesians 5:28 ESV","verseRepeat":"In the same way husbands should love theirwives as their own bodies. He who loves hiswife loves himself.","blurb":"OAP: God I ask you'd help me love my wife as myself, as though we really were one body. Help me see her needs and pains as though they are exactly mine. And help me see others in a similar light Lord, for your glory. Thank you for this day you have made, and for your word that guides me to you.","name":"IMG_3354.txt","index":293},{"verse":"Ephesians 6:4 ESV","verseRepeat":"Fathers, do not provoke your children toanger, but bring them up in the discipline andinstruction of the Lord.","blurb":"OAP: God as me and Libby are trying to have a child, I ask you'd help me know what this verse will mean say to day. That I'd be a good father to any children you may gift us with while still being a good husband to my bride and a good servant of my employer. Help me discipline future children out of love, but never drive them to anger.","name":"IMG_3356.txt","index":294},{"verse":"Ephesians 6:7 ESV","verseRepeat":"rendering service with a good will as to theLord and not to man,","blurb":"OAP: God I ask my deeds would be for you and not for man, that I would seek your glory and honor through my actions, not the approval of others or the glory and honor of other men. I ask I'd be pleasing to you. Help me not forget as I go about my work day this week that I have a king that I serve, you. And my mission is bigger than what is right in front of me.","name":"IMG_3364.txt","index":295},{"verse":"Ephesians 6:18 ESV","verseRepeat":"praying at all times in the Spirit, with all prayerand supplication. To that end keep alert withall perseverance, making supplication for allthe saints,","blurb":"OAP: God I ask you'd guide me in how to pray in the spirit that I may be aligned with you. I ask you'd guide me day to day and in my work that I be a good servant and not grow weary or allow myself to forget that I am truly blessed by you my savior and God. Guide my deeds and thoughts to be pleasing to you.","name":"IMG_3357.txt","index":296},{"verse":"Philippians 1:21 ESV","verseRepeat":"For to me to live is Christ, and to die is gain.","blurb":"OAP: Lord I pray that my heart and mind would be like Paul's here that Christ would be life to me. I ask I not be too easily contented with the world but instead that I would delight and seek your son and his presence in the next life. Help me live for you above all and I ask your forgiveness for how I have fallen short of this. I thank you for this day and all the joy that came with it. You are my true source of joy Lord. All glory to you.","name":"IMG_3366.txt","index":297},{"verse":"Philippians 2:3-4 ESV","verseRepeat":"Do nothing from selfish ambition or conceit,but in humility count others more significantthan yourselves. Let each of you look not onlyto his own interests, but also to the interestsof others.","blurb":"OAP: God I pray you'd help me live this out and I thank you for the opportunity you have given me to serve in a small way in this community. Thank you for giving me excess such that I can help others. Help me be more generous than I am and more loving, that I could be like your son and glorify and please you God. All I have is yours, and to you I owe everything. Help me serve others with a greater fervor than I serve myself Lord, so that they could see your love for them.","name":"IMG_3367.txt","index":298},{"verse":"Philippians 2:14-15 ESV","verseRepeat":"Do all things without grumbling or disputing,that you may be blameless and innocent,children of God without blemish in the midstof a crooked and twisted generation, amongwhom you shine as lights in the world,","blurb":"OAP: God help me remember that I am to do everything I do without grumbling or disputing. Help me be a good servant to others, and help me be a light in a twisted generation that I may point others to you and your goodness. I ask you'd forgive me my sins and help me do well tomorrow. I thank you for this day and your many blessings.","name":"IMG_3370.txt","index":299},{"verse":"Philippians 3:10 ESV","verseRepeat":"that I may know him and the power of hisresurrection, and may share his sufferings,becoming like him in his death,","blurb":"OAP: I ask lord you would help me know more of Christ and the power of the resurrection that has taken place inside of me, that I not be fooled into thinking I am the same, but embrace the new birth and live that out rather than a life like what I once had. Glory to you Lord and thank you for this day.","name":"IMG_3373.txt","index":300},{"verse":"Philippians 4:6 ESV","verseRepeat":"do not be anxious about anything, but ineverything by prayer and supplication withthanksgiving let your requests be madeknown to God.","blurb":"OAP: God help me pray more than I do and to seek you and your presence out more than I do now. Forgive me for my anxiousness and thank you for how you have blessed and protected me and Libby during our first years of marriage. You are good Lord and you have blessed me to overflowing. Help me show that love towards others as well and thank you for this day.","name":"IMG_3375.txt","index":301},{"verse":"Philippians 4:8 ESV","verseRepeat":"Finally, brothers, whatever is true, whatever ishonorable, whatever is just, whatever is pure,whatever is lovely, whatever is commendable,if there is any excellence, if there is anythingworthy of praise, think about these things.","blurb":"OA: I should strive to think about good and honorable things, things worthy of praise. My mind should not be focused on things that make a soul cynical or crass, but I should seek out that which makes me a more honorable Christ like person. Thinking in nourishing encouraging things. P: God help me keep me eyes on what is nourishing to my soul. Help me turn away from that which would erode in my heart and mind what you have thought me through your faithfulness and word. T          •   is day you have made.","name":"IMG_3376.txt","index":302},{"verse":"Colossians 1:9 ESV","verseRepeat":"And so, from the day we heard, we have notceased to pray for you, asking that you may befilled with the knowledge of his will in all spiritualwisdom and understanding,","blurb":"OAP: God I ask you'd teach me how to pray for others and not just focus inward during my prayers but be mindful of others their needs and the role of prayer in my life. I thank you for this day you have made and this time with family. I am very blessed lord.","name":"IMG_0009.txt","index":303},{"verse":"Colossians 2:14 ESV","verseRepeat":"by canceling the record of debt that stood againstus with its legal demands. This he set aside, nailingit to the cross.","blurb":"0: Christ cleared us of the legal requirements of the law, mere shadows that pointed to him. A: Praise God for the salvation of Christ over your life. It is a gift that cannot be overstated or fully understood in this life, but Christ has brought our dead selves to life. P: God thank you for this salvation you have given. I ask your forgiveness for the pride I exhibited today and I ask you'd uproot it from me, that I take no part in pride but look to your son and what he has done for me. Help me meditate in your grace daily.","name":"IMG_0011.txt","index":304},{"verse":"Colossians 2:23 ESV","verseRepeat":"These have indeed an appearance of wisdomin promoting self-made religion andasceticism and severity to the body, but theyare of no value in stopping the indulgence ofthe flesh.","blurb":"0: Some restrictions people put on themselves are misguided. In thinking they are applying themselves to wisdom and self control they are instead giving themselves a false sense of confidence and are still just as vulnerable to indulgence of the flesh. A: I should know that seeking Christ is the answer, not necessarily extra restrictions, but Christ! P: God I ask you forgive me for when I have sought guidance in other things. I ask you'd bring me closer to your son and that I know you better.","name":"IMG_3377.txt","index":305},{"verse":"Colossians 3:14 ESV","verseRepeat":"And above all these put on love, which bindseverything together in perfect harmony.","blurb":"OAP: God I ask you'd help me put on love, that I would love others as you would have me love others, laying down my pride and desire for selfish gain and instead taking on the burdens of others as your son did for me. Help me carry the load of others and support them even though they cannot support me. Help me serve and glorify you through this, and thank you for the this word and this day you have made. To you be the glory.","name":"IMG_3378.txt","index":306},{"verse":"Colossians 3:17 ESV","verseRepeat":"And whatever you do, in word or deed, doeverything in the name of the Lord Jesus, givingthanks to God the Father through him.","blurb":"OAP: God thank you for how you have blessed me. For the salvation of my soul and for making me a new creature in spite of my sin. I also thank you for my family who I love. Help me and Libby love them well. Thank you for this day you have made. Thank you for providing all my needs and being my comfort and guide in time of need. You are great.","name":"IMG_0012.txt","index":307},{"verse":"Colossians 3:23 ESV","verseRepeat":"Whatever you do, work heartily, as for theLord and not for men,","blurb":"OA: when I go about my work I should try to remember that it is to the lord that I offer up my labor. The talents he gave, the means he gave, and it is by grace there are fruit. I should be glad in my work and serve honestly and not as a people pleaser. P: God I ask you'd help not just be a people pleaser but to serve others genuinely. Help me always be forthright and honest but to also be wise and not speak when I should not speak. Thank you for this day you have made.","name":"IMG_3380.txt","index":308},{"verse":"Colossians 4:5-6 ESV","verseRepeat":"Walk in wisdom toward outsiders, making thebest use of the time. Let your speech alwaysbe gracious, seasoned with salt, so that youmay know how you ought to answer eachperson.","blurb":"OA: I should think carefully before I speak, and only speak on what is good and right. I should seek to be wise in matters regarding my faith so that I can speak well about them. P: God I ask you'd season my speech with salt. Help me make good use of time when walking with outsiders and to speak well of you so that they may know you as you have taught me to know you. Thank you for this day.","name":"IMG_3381.txt","index":309},{"verse":"1 Thessalonians 4:12 ESV","verseRepeat":"so that you may walk properly before outsidersand be dependent on no one.","blurb":"OAP: God, I ask I'd be a good representative of you to others as I go through life, that outsiders could see a bit of you operating through me in love and wisdom. I ask I better serve others and you'd remove all pride from my heart. Help me lift up my household and to be a good honest laborer living quietly. Showing brotherly love to my fellow Christian, and the outsider. As you did for me when I was an outsider, and as you still do when I act like an outsider. You are great Lord and thank you for this day.","name":"IMG_0007.txt","index":310},{"verse":"1 Thessalonians 4:14 ESV","verseRepeat":"For since we believe that Jesus died and roseagain, even so, through Jesus, God will bring withhim those who have fallen asleep.","blurb":"OAP: God I ask you'd help me realize deeper that this world is not the end but that there is a eternity waiting for us that will be greater than what I can now imagine. Thank you for saving my soul lord. Help me not lose sight of this big thing though the things of life may distract help me always remember this","name":"IMG_0008.txt","index":311},{"verse":"2 Timothy 1:9 ESV","verseRepeat":"who saved us and called us to a holy calling, notbecause of our works but because of his ownpurpose and grace, which he gave us in ChristJesus before the ages began,","blurb":"OA: we are not saved by works but are instead saved by the grace of God. We are called to be his image bearers to the nations and if we know Christ as our savior we can stand strong against forces of resistance to us advancing his kingdom. P: God I ask you'd empower me to do good work for you. Help me be strong against efforts by the enemy and to praise you loudest when I suffer the most. Help me be a good husband and leader to my wife as your son is a good husband and leader to the church. I thank you for this day you have made.","name":"IMG_0208.txt","index":312},{"verse":"Titus 2:7 ESV","verseRepeat":"Show yourself in all respects to be a model of goodworks, and in your teaching show integrity, dignity,","blurb":"OAP: God I ask you'd help me do this. Help me be a good example of you to others as a member of your kingdom. You have blessed us greatly, and you are a good king, the god above all other \"gods\" Thank you for this day you have made. I ask you inspire my thoughts and words.","name":"IMG_0218.txt","index":313},{"verse":"James 1:27 ESV","verseRepeat":"Religion that is pure and undefiled before God, theFather, is this: to visit orphans and widows in theiraffliction, and to keep oneself unstained from theworld.","blurb":"OAP: Lord I pray you'd provide opportunities for me to be with those weaker than I so that I can love and support them though while receiving nothing in return. Because you Lord loves us though we had nothing to give to add to your glory. You were perfect and while and yet came down and live among us and suffered for us. Help me take this fact and remember it - and be wise in applying it outwardly. Help me faith have works that are pleasing to you. Thank you for this day you have made and in Jesus name I pray.","name":"IMG_0598.txt","index":314},{"verse":"James 2:26 ESV","verseRepeat":"For as the body apart from the spirit is dead, soalso faith apart from works is dead.","blurb":"OA: our acknowledgement of Christ is not in and of itself sufficient evidence of a real faith - unless it is reflected in the walk of someone's life. Fruit accompanies a real faith. Sacrificing as Christ sacrificed is the sign of Christ in us. Loving as he loved and serving as he served. We therefore should strive to be like Christ, because he is worth and he is our king. P: God I ask that the unseen realities would always be solid in my heart and actions. Please guide me in what I do and steer me away from calamity. Help me serve my family and fellow man well in a way that pleases you. Help me make good decisions. Help me have fruit that honors you. Thank you for this day you have made.","name":"IMG_0590.txt","index":315},{"verse":"James 3:9-10 ESV","verseRepeat":"With it we bless our Lord and Father, and with it wecurse people who are made in the likeness of God.From the same mouth come blessing and cursing.My brothers, these things ought not to be so.","blurb":"OA: if I am verbally harsh to someone I am disrespecting the likeness of God. Every human life is sacred, and is an eternal being like me. Their soul ways the same and with great patience and understanding I should communicate with others as I would have them do to me. P: God I ask you'd help me control my speech better than I do. I ask you'd steer me in a good direction for your glory. Thank you for this day you have made. Though it may be impossible for man to tame his rouge you surly can and I ask you would. Thank you for this day you have made and my many blessings.","name":"IMG_0216.txt","index":316},{"verse":"Jude 1:22-23 ESV","verseRepeat":"And have mercy on those who doubt; save othersby snatching them out of the fire; to others showmercy with fear, hating even the garment stainedby the flesh.","blurb":"OAP: God I ask you help me have mercy and love those who doubt in you and your son. I pray I could do my part whatever that may be to steer others towards you. I ask you'd also help me steer clear of those that would seek to destroy me. Thank you for this day you have made lord.","name":"IMG_0013.txt","index":317},{"verse":"Jude 1:25 ESV","verseRepeat":"to the only God, our Savior, through Jesus Christour Lord, be glory, majesty, dominion, andauthority, before all time and now and forever.Amen.","blurb":"OAP: Lord I ask your rule would be over all the earth. I pray your son's kingship would grow everywhere. We are a broken world in need of a savior. I ask you'd empower us your church to be your hands and feet and glorify you by showing your love and wisdom and justice to everyone. Thank you for this day you have made and your countless blessings lord. You are awesome.","name":"IMG_0665.txt","index":318},{"verse":"Psalm 72:1-2 ESV","verseRepeat":"Give the king your justice, 0 God, and yourrighteousness to the royal son! May he judge yourpeople with righteousness, and your poor withjustice!","blurb":"OA: we are to seek the flourishing and honor of our leaders. And the leader whose success we are to pray for most is that Christ's kingdom would rule all the earth. That in love and praise for God we would all be united under his banner and evil would be banished. So we are to in all things seek to honor our leaders and have our success be their victory. P: God help me serve others well and glorify you above all. You are my true ruler and it is you u serve. Glory to you God. May every work of my hand and word I speak lift you up. Thank you for this day and the incredible blessings you've placed in my life. All I have is yours. Help me use what I have for your glory.","name":"IMG_0531.txt","index":319},{"verse":"Psalm 73:19-20 ESV","verseRepeat":"How they are destroyed in a moment, swept awayutterly by terrors! Like a dream when one awakes,0 Lord, when you rouse yourself, you despisethem as phantoms.","blurb":"OA: when we place our trust in anything other than God we are on a very shaky foundation and things will begin to crumble. God is the only Rock we can reliably stand on. And though things may grow chaotic and wild and suffer may abound for a time - God stands in control and unshaken. He is what we should place our trust in and nothing else. P: God I thank you for being my rock and foundation when things get hard. You are unshakeable and though I am weak and my time in this life a vapor you stand forever and your rule knows no end. Glory to you and thank you for this day.","name":"IMG_0532.txt","index":320},{"verse":"Psalm 74:23 ESV","verseRepeat":"Do not forget the clamor of your foes, the uproarof those who rise against you, which goes upcontinually!","blurb":"OA: in a similar way to how we pray for God's kingdom to flourish here on earth and that those who glorify him would be lifted up we should pray that those who devise evil be brought low and that they would foil in vain. There are also principalities out there that seek our destruction. And we are to pray for their destruction. P: God I ask that proud boasters that put themselves in your place would be brought low and come to know you as God rather than thinking they themselves rule things. We are small Lord but you are grand. Thank you for your love, mercy, and guidance. I ask for wisdom and peace as we prepare for a child and Libby to have good health.","name":"IMG_0534.txt","index":321},{"verse":"Psalm 143:12 ESV","verseRepeat":"And in your steadfast love you will cut off myenemies, and you will destroy all the adversaries ofmy soul, for I am your servant.","blurb":"OA: when we are suffering deeply it is often the best time to reflect on who God is and his character that we know to be true. Though life has infinite unknowns one thing we know is God's unchanging character. And from that flows our hope and joy. P: God help me always recall your amazing character and who I am in you Lord. I am your servant, redeemed by the death of your son, a member of your family. And you are my great faithful forgiving merciful loving Lord. I try to love others because your perfectly do this and I wish to be like you Lord. Thank you for this day you have made and your provision over us.","name":"IMG_0547.txt","index":322},{"verse":"Psalm 144:1-2 ESV","verseRepeat":"Blessed be the Lord, my rock, who trains my handsfor war, and my fingers for battle; he is mysteadfast love and my fortress, my stronghold andmy deliverer, my shield and he in whom I takerefuge, who subdues peoples under me.","blurb":"OAP: Lord you are the one from whom wisdom flows. You train me to confront life and to try and live it well. I ask Lord that you'd be with me and be with Libby during this hard time with her experiencing illness due to (we think) pregnancy. Help us do everything we can to reduce her pain and help her rest and I ask where there is nothing we can do that you would step in and heal. Thank you lord for this day and your many blessings. In Jesus name I pray, amen.","name":"IMG_0548.txt","index":323},{"verse":"Psalm 145:19 ESV","verseRepeat":"He fulfills the desire of those who fear him; he alsohears their cry and saves them.","blurb":"OAP: Lord your word here says you are with those who call out to you and fear you. Lord I am deeply sinful but made clean by your son and a child of yours. And I ask you'd be with my wife. Help us navigate her pregnancy with its ups and downs and give her rest and healing. Lord help us glorify you and be good parents and grow your kingdom. Thank you for this day and your provision and help. I ask for your help in this specific way now and help us learn what there is to learn.","name":"IMG_0549.txt","index":324},{"verse":"Psalm 82:8 ESV","verseRepeat":"Arise, 0 God, judge the earth; for you shall inheritall the nations!","blurb":"OAP: Lord I ask your kingdom would come to earth. I ask you'd give us your followers victory over the enemy that wishes us failure and that we'd spread your word and your ways. Upholding justice and demonstrating power through its wise restraint. Help me do my part in this effort and support others as they do their part. Help us love our enemies and pray for those who persecute us. Help us love all men, and be humble servants for your glory. Thank you for this day you have made and glory to you lord.","name":"IMG_0644.txt","index":325},{"verse":"Psalm 84:10 ESV","verseRepeat":"For a day in your courts is better than a thousandelsewhere. I would rather be a doorkeeper in thehouse of my God than dwell in the tents ofwickedness.","blurb":"OA: it is always better to be with God and to be in his will and be poor in the sight of the world, than away from God but at the highest level among men. P: Lord help me to always first seek out your kingdom. Help me not lean on the worlds perceptions but on your word and what I know to be true. Help me conduct myself well, and be wise, discerning, and also kind and good and honest. Even at the cost of worldly position help me be honest Lord. Thank you for this day you have made and this reminder. In Jesus name I pray, amen.","name":"IMG_0648.txt","index":326},{"verse":"Psalm 86:16 ESV","verseRepeat":"Turn to me and be gracious to me; give yourstrength to your servant, and save the son of yourmaidservant.","blurb":"OAP: Lord all the strength I have is a gift from you. I ask you'd empower me to deal with all uncertainties that are coming in life. I ask for strength to be a father and a good husband, strength to be a loving neighbor, strength to be a good son to my parents. Help me conduct myself wisely in all my relationships. Help me be a good worker and help me most of all to be a good follower of you. You are where my meaning stems from. You are the rock that stands. I ask for forgiveness for me often forgetting this. Thank you for this day you have made.","name":"IMG_0650.txt","index":327},{"verse":"Psalm 89:52 ESV","verseRepeat":"Blessed be the Lord forever! Amen and Amen.","blurb":"OA: even when times are at their hardest it is the perfect time for glorifying God and lifting him up. Christ has paid the price for us and God is glorious and worthy - no matter what things we might be going through. P: Lord thank you for your blessings and glory to you. Help me be a more honorable follower of you that pleases you. Help me be useful to my neighbor and a good help to my wife and future child. Thank you for this day you have made.","name":"IMG_0651.txt","index":328},{"verse":"Psalm 90:4 ESV","verseRepeat":"For a thousand years in your sight are but asyesterday when it is past, or as a watch in thenight.","blurb":"OA: God's timing is often not our timing. The decisions we make as humans are made with human timings in mind but God's timings could span millennia. We should be patient for a move of the lord because God may often have a bigger plan in mind than what we humans can conceive. P: Lord help me be patient, faithful and obedient when I feel I've been waiting too long or I grow confused. Your timing and your reasoning are not like a man's but far greater. Help me remember this in hard times where you seem far off.","name":"IMG_0653.txt","index":329},{"verse":"Psalm 91:13 ESV","verseRepeat":"You will tread on the lion and the adder; the younglion and the serpent you will trample underfoot.","blurb":"OAP: God you are our present help against all the forces that work against us and the progression of your kingdom. With you behind us we cannot fail and we will succeed at all we set our minds to. Thank you for this day and the safe travels you have granted us. We are very blessed Lord and I'm grateful for your salvation and your daily mercies.","name":"IMG_0656.txt","index":330},{"verse":"Corinthians 3:13","verseRepeat":"each one's work will becomemanifest, for the Day will disclose it,because it will be revealed by fire, andthe fire will test what sort of work eachone has done.","blurb":"OA: As Christians we are to be uncompromising in the love we have for others in all wisdom and the people and relationships we build, so that it's foundations will be secure and withstand the fire. P: God help me build solid foundations in my life that will stand the test of time   and thank you for this day you have and thank you for this day you have made. You are good lord. Help me build good things.","name":"IMG_3157.txt","index":331},{"verse":"Revelation 1:16 ESV","verseRepeat":"In his right hand he held seven stars, from hismouth came a sharp two-edged sword, and hisface was like the sun shining in full strength.","blurb":"OA: Our king speaks truth and that truth is uncompromising as a blade. Jesus is the appointed ruler of all the earth exalted by the father over all creation. We are to glorify him and use the truth to do good and cut through falsehood. P: Lord help me retain your word and to be wise. Your ways are great Lord. The ways of man are flawed by you and your precepts are life. To you I owe everything. Thank you for your word that I have today 2000 years later. I pray I could retain it and instill the love of it in me and Libby's child. Thank you for this day you have made and for your daily mercies.","name":"IMG_0669.txt","index":332},{"verse":"Revelation 3:17 ESV","verseRepeat":"For you say, I am rich, I have prospered, and I neednothing, not realizing that you are wretched,pitiable, poor, blind, and naked.","blurb":"0: if we do not have God, then we are impoverished and do not yet know. We cannot see though we think we can, and we are vulnerable though we feel secure. Without God we are aimless and in danger. A: Cling to God and his work and seek out his wisdom diligently. He is your safe refugee and your hope for the future. P: Lord you are my hope and help though I am an ignorant man full of flaws and bad speech. I ask you'd teach me how to live and help me love others as I love myself. Thank you for this day you have made and your word. In Jesus name I pray - amen.","name":"IMG_0671.txt","index":333},{"verse":"Revelation 4:11 ESV","verseRepeat":"\"Worthy are you, our Lord and God, to receiveglory and honor and power, for you created allthings, and by your will they existed and werecreated.\"","blurb":"OAP: Lord all I have is really yours, it has simply been !ended for a time. My wife does not belong to me but she is a gift from you for a time. The child that grows in her is not mine but a gift and a call on my life for a time. My job does not belong to me but it is a place you have put me that I praise you for. By your grace I feed myself and family. By your grace I have your word to guide me and steer me from danger. By grace I have a family who loves me and who loves you. All good things I have or have experienced are by your hand. Thank you for your forgiveness, mercy, patience and love Lord. With you with me I cannot fail.","name":"IMG_0673.txt","index":334},{"verse":"Revelation 5:10 ESV","verseRepeat":"and you have made them a kingdom and priests toour God, and they shall reign on the earth.\"","blurb":"OA: We are to be a people who lift up the earth and steer it to the good for the glory of our King. Through Christ's death we are reborn into his family and kingdom. And we are to reflect his light wherever we go as an extension of his will. P: God, I ask you'd help me be more like you and to reflect your will out to others. I ask for your guidance and refinement that I could steer others towards you and be your generous hand to others. Please make me wise and good and to please you with what I do. Thank you for this day you have made and for my many blessings. My words will always be insufficient for what you have done for me and are doing for all of us.","name":"IMG_0674.txt","index":335},{"verse":"Revelation 6:16-17 ESV","verseRepeat":"calling to the mountains and rocks, \"Fall on us andhide us from the face of him who is seated on thethrone, and from the wrath of the Lamb, for thegreat day of their wrath has come, and who canstand?\"","blurb":"OA: there is coming, a great day of judgement. And all powers of this earth we be brought low and all leaders cast down for we are all nothing when compared to Christ and his kingdom. It is therefore wise to not place my trust in the people and systems in this world but to turn to and trust in God. P: Lord though some would say we are living through unpredictable times - I know that as humans we are always living in unpredictable times it's just sometimes we do not know it. You are in control now and always. And you have always been in control. You are mighty and good to us. Thank you for your grace and patience as I try to learn what it is to be a member of your kingdom.","name":"IMG_0677.txt","index":336},{"verse":"Revelation 7:15 ESV","verseRepeat":"\"Therefore they are before the throne of God, andserve him day and night in his temple; and he whosits on the throne will shelter them with hispresence.","blurb":"0: in the next life we will be able to be in the presence of and serve uninhibited - our God. A: meditate on the end destination daily that you not lose sight of the temporary nature of your time here. You have a purpose here that is important however you will ultimately be called up to serve God for eternity in a new world under his perfect lordship. P: Lord, I ask you'd help this message sink in. I pray I'd glorify you in this life and I thank you for the chance to do it in the next. Thank you for this day you have made and your many blessings.","name":"IMG_0678.txt","index":337}]